[
    {
        "title": "Giresunspor have collapsed",
        "body": "They were once in the in the Super lig and beat the likes of Beşiktas, Fenerbahçe and Galatasaray all away from home. They may file for bankruptcy very soon.",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 46,
        "date": "2024-12-07 11:41:25"
    },
    {
        "title": "This game tomorrow has the chance to make or break either teams seasons.",
        "body": "If Fenerbahçe is to win this game, they will close the gap on Galatasaray and have motivation to perform well in Europe, If Besiktas win, they will give Galatsaray an upper hand in the title race and demotivate the Fenerbahçe players, whatever happens in this game the whole country is watching 👀.",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 73,
        "date": "2024-12-06 21:33:32"
    },
    {
        "title": "Bize her yer Kasimpasa! (RTE Stadyum Haric)",
        "body": "",
        "subreddit": "superlig",
        "author": "LegitimateCup8797",
        "score": 25,
        "date": "2024-12-06 19:11:51"
    },
    {
        "title": "Galatasaray (1st) and Fenerbahçe (3rd) are among the most searched teams on Transfermarkt",
        "body": "Credits to u/Turksubslut (awesome username) from the gs sub",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 95,
        "date": "2024-12-04 16:35:03"
    },
    {
        "title": "How much better do Süper Lig teams perform when playing home? The table shows goals scored, goal conceded and points per game (PPG)",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 17,
        "date": "2024-12-04 15:40:23"
    },
    {
        "title": "Süper Lig standings after matchday 14.",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 45,
        "date": "2024-12-02 19:08:21"
    },
    {
        "title": "Galatasaray Eyüp maci",
        "body": "Maçta topun oyunda kalma süresi 43 dk, kronometre süresi 108dk. benim parasını odedigi. ama izleyemedigim 65dkin hesabını kim vericek? buna bir dur denmesi gerekiyor....",
        "subreddit": "superlig",
        "author": "Kamachio",
        "score": 46,
        "date": "2024-12-01 18:45:56"
    },
    {
        "title": "Galatasaray missed 10 big chances against Eyüpspor in today's game which ended in a 2-2 draw.",
        "body": "",
        "subreddit": "superlig",
        "author": "DonuandDeca",
        "score": 75,
        "date": "2024-12-01 18:09:16"
    },
    {
        "title": "Yağız Sabuncuoğlu: I think Galatasaray and Trabzonspor want TFF’s president to resign. Beşiktaş and Fenerbahçe want him to stay. Fenerbahçe’s board thinks Osmanoğlu will ensure a fair playing field.",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 28,
        "date": "2024-11-30 00:30:14"
    },
    {
        "title": "The rest of Matchweek 14 fixtures",
        "body": "Who will win each game?",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 6,
        "date": "2024-11-29 22:40:44"
    },
    {
        "title": "Europa League standings after matchday 5. Next games: Malmö V Galatasaray, Fenerbahçe V Bilbao, Bodo/Glimt V Beşiktaş.",
        "body": "",
        "subreddit": "superlig",
        "author": "eanwen0",
        "score": 33,
        "date": "2024-11-28 22:18:16"
    },
    {
        "title": "Galatasaray draw against AZ Alkmaar.",
        "body": "",
        "subreddit": "superlig",
        "author": "sparkle_stylinson",
        "score": 62,
        "date": "2024-11-28 19:58:01"
    },
    {
        "title": "Galatasaray's and Besiktas's lineups",
        "body": "Good luck to both teams 👏 ",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 23,
        "date": "2024-11-28 17:04:35"
    },
    {
        "title": "[European matches thread] AZ vs. Galatasaray / Beşiktaş vs. Maccabi / Slavia vs. Fenerbahçe.",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 12,
        "date": "2024-11-28 17:01:26"
    },
    {
        "title": "Galatasaray,Fenerbahçe and Beşiktas's positions in the Europa league before matchday 5",
        "body": "If Fenerbahçe and Besiktas both win they can move into the top10 potentially.",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 30,
        "date": "2024-11-28 13:00:56"
    },
    {
        "title": "Galatasaray🤝 Man city chocking 3-0 leads at home",
        "body": "",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 95,
        "date": "2024-11-26 22:45:49"
    },
    {
        "title": "Standings after matchday 13.",
        "body": "",
        "subreddit": "superlig",
        "author": "eanwen0",
        "score": 56,
        "date": "2024-11-25 20:29:33"
    },
    {
        "title": "Could Samsunspor really get into Europe after transfer ban 🫣",
        "body": "",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 92,
        "date": "2024-11-24 18:44:32"
    },
    {
        "title": "Fenerbahçe and Galatasaray have the exact same goal difference after 12 matches (33/11)",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 46,
        "date": "2024-11-24 11:51:05"
    },
    {
        "title": "Financials of the Big 3 - a basic analysis",
        "body": "**Hi everyone!**   \n  \nFinancial results for Q1 2024 were shared in our GS sub, and the reactions prompted me to make a quick post about this. There is a summary/TLDR at the bottom if you want to skip the text, though.   \n\n\n**Disclaimer:** This is not financial advice. Never listen to some random person on Reddit who could be lying about everything. Thx &lt;3\n\n  \nPeople were kinda panicking because all our clubs are reaching record debt levels. The situation isn't all that bad, actually. However, it’s basically impossible to understand what the h\\*\\*\\* is going on when clubs just throw out huge numbers like “we are X gajillion in debt” without having studied finance. So, let’s analyze the numbers a little.  \n\n\n# About Me (feel free to skip)\n\nMy Turkish sucks, but I have a background in a very niche area of investment finance, analyzing company financials and making investment decisions for a living. I’ve done this for funds worth more than the combined value of the three clubs. I've also studied finance with reasonable success. There are surely better people here to look at public financials (my focus being private, and not in Türkiye), but let me kick it off, and you guys can correct me as we go. I don’t see enough data-driven financial discussions, yet I constantly hear “but X cannot afford Y,” so let’s change that.\n\n\n\n# What I Don’t Know\n\n* Any deals and data not provided in the KAP financial summaries. If you know where to find more/better info, LMK.\n* Details of refinancing agreements and interest rates.\n* What \"Bankalar Birliği\" even means in practice - I understand there is an agreement with banks that some proportion of debt is covered by some proportion of net income? Feel free to add info here and correct me.\n* A lot of other stuff in general but let's not talk about that \n\n\n\nMy sources are the Excel sheets downloaded from KAP. For example, Galatasaray’s data can be found here:  \n[https://www.kap.org.tr/en/sirket-finansal-bilgileri/4028e4a14203278a0142095598f114ba](https://www.kap.org.tr/en/sirket-finansal-bilgileri/4028e4a14203278a0142095598f114ba)\n\n  \n\n\n# OK LETS START - Key Numbers to Focus On\n\n\n\n# 1. Liability-to-Asset Ratios\n\nIn simple terms, liabilities are what clubs owe and assets are what clubs have. A ratio above 1 indicates that a club owes more than it has, which is OK in some (very few) situations but unsustainable in the long run.\n\n\n\n|Year|GS|FB|BJK|\n|:-|:-|:-|:-|\n|**2021**|137%|136%|202%|\n|**2022**|138%|134%|198%|\n|**2023**|95%|113%|147%|\n|**2024Q1**|95%|104%|130%|\n\n**Trend**:\n\n* **Overall**: the TREND is POSITIVE. All clubs are deleveraging. This is what we would expect: interest rates go up, \"cost of debt\" (i.e. how expensive it is to take a loan) increases, so clubs reduce the % of their financing through debt. The overall amount of debt is quite high though. \n* **GS**: Improved significantly from 2021 - only club with positive Equity i.e. less total liabilities than total assets. While it's the healthiest of the 3, 95% is still crazy high. \n* **FB**: The ratio remains above 100%, nevertheless improving slowly but steadily. \n* **BJK**: Still leveraged up to the \\*\\*\\*\\* (are we allowed to say that word here?), but it has improved **MASSIVELY**. Holy smokes BJK, well done. But also, you guys are so overleveraged, Im surprised you managed to avoid bankruptcy. Keep up the good work though. \n\n  \nNote that it's quite expected that clubs have high debt. Interest rates in Turkey were low while the currency was in inflation. Financing old debt with new debt and taking on loans for new investments makes a lot of sense. Nevertheless, it'd be a stretch to say our clubs are financially stable and (without having calculated ideal values) I feel like the goal should be to get closer to 70% than 130%. Tech companies with uncertain cash flows tend to aim for 20ish-50ish % depending on the relative cost of debt and equity. Over 100 kinda blows my mind. \n\n\n\n# 2. Long-Term vs. Short-Term Debt\n\nOK so I already hinted at the fact that looking at total liabilities alone does not paint the whole picture. There are low interest loans and high interest loans, short term debt and long term debt. For simplicity, we'll assume that short term debt is recent and at higher interest rates. Thus, more expensive. Shortterm debt is also more dangerous because it needs to be paid back soon. Can't pay and you have a big oopsie. So what are good numbers here? You want long-term rather than short-term debt and you hope that the proportion of short-term is generally DECREASING.   \n\n\n|Year|GS (Short/Long)|FB (Short/Long)|BJK (Short/Long)|\n|:-|:-|:-|:-|\n|**2021**|1.59B / 2.59B|1.48B / 3.42B|1.20B / 3.58B|\n|**2022**|4.50B / 3.04B|2.87B / 3.29B|1.74B / 4.14B|\n|**2023**|6.44B / 4.16B|5.93B / 3.45B|4.45B / 5.03B|\n|**2024Q1**|9.30B / 4.94B|9.64B / 3.42B|5.93B / 4.49B|\n\n  \n**Overall**: Kinda meh, to not say very bad. Clubs are still taking on a lot of debt and even more so now. Why? God knows. Is it the race between FB and GS that seems to have reached new highs? But debt is really expensive right now so that's not a great look. N.B.: these are not in real terms, they're not adjusted for inflation. So look at ratios more than the figures. \n\n* **GS**: Not great, thats a lot of new debt. As we will discuss later, GS does not have a lot of liquid reserves to pay off this debt. \n* **FB**: Same as GS, just worse. Almost doubled short-term debt. What's costing you guys so much? On the upside, FB has more liquid assets as we will discuss later. \n* **BJK**: Healthiest proportion of short-term vs long-term debt. But you guys shouldn't be taking on new debt unless your lives depends on it so... hm. We know that later on you guys go for Immobile and Rafa. \n\n  \n\n\n**3. Revenues**\n\nOK so we looked at debt. Next, we obviously need to look at the top line and see how much money is coming in. Little disclaimer here, it would be great to look at a more detailed breakdown of earnings but the KAP statements does not provide that - if anyone has more info, please share. \n\n\n\n|Year|Galatasaray (GS)|Fenerbahçe (FB)|Beşiktaş (BJK)|\n|:-|:-|:-|:-|\n|**2021**|1.19 billion TL|1.30 billion TL|987 million TL|\n|**2022**|1.76 billion TL|2.06 billion TL|1.33 billion TL|\n|**2023**|7.95 billion TL|5.52 billion TL|3.43 billion TL|\n|**2024 Q1**|1.89 billion TL|1.33 billion TL|1.13 billion TL|\n\n**Trend**:\n\n* **Overall**: Very positive. All clubs are improving their upside. \n* **GS**: Significant improvement in 2023, putting GS well ahead of their competition. IDK what they did but it worked. Actually very solid development. GS has turned into a money-making machine. Can they keep it up? \n* **FB**: While figures are behind GS since 2023, they're reliably improving. \n* **BJK**: Growth similar-ish to FB, but on a smaller scale. I would however argue that for Besiktas, increasing revenues should be less of a target than cutting costs. \n\n\n\n# 4. Revenue-to-Liability Ratios\n\nThis ratio shows how much revenue supports total liabilities. Higher is better, as it reflects the club’s ability to service its debt. A club that takes on debt without ability to earn is a little crazy and not in the hot way. \n\n|Year|GS|FB|BJK|\n|:-|:-|:-|:-|\n|**2021**|0.28|0.27|0.21|\n|**2022**|0.23|0.33|0.23|\n|**2023**|0.75|0.59|0.36|\n|**2024Q1**|0.13|0.10|0.11|\n\n**Trend**:\n\n* **Overall**: Very positive. All clubs are moving towards MORE stability. \n* **GS**: Significant improvement in 2023. Actually very solid development. What this ratio doesn't show well: they kinda mess up the number in Q1 2024 by taking on a LOT of new debt. \n* **FB**: While figures are behind GS since 2023, they're more reliably improving. FB is doing very OK!\n* **BJK**: The weakest link among the big 3 with the poorest trajectory. Nevertheless, the trajectory is positive and they understood the assignment. Reduce leverage, increase revenues relative to liabilities in order to achieve stability (and qualify for better refinancing). \n\n  \n\n\n# 5. Short-Term vs. Long-Term Assets\n\nOne last thing I want to highlight is the 3 clubs differences in long term vs short term assets. Short-term are Cash or what is called \"cash equivalents\" - things, that can be turned into cash quickly. Probably not Collector's Cards or Whiskey. \n\nLongterm assets take time to sell. Could be players, facilities, etc. I guess an island. Note that their valuation also carries more uncertainty. \n\nAs for how much short-term vs long-term is good, this is a VERY contentious topic. I'll leave that to you guys to decide. Sometimes you should invest all your cash equivalents and sometimes you should hold the money. So I'll skip judgment here.   \n\n\n|Year|GS (Short/Long)|FB (Short/Long)|BJK (Short/Long)|\n|:-|:-|:-|:-|\n|**2021**|0.46B / 2.59B|3.33B / 0.28B|2.01B / 0.37B|\n|**2022**|1.98B / 3.46B|3.75B / 0.83B|2.25B / 0.71B|\n|**2023**|2.29B / 8.84B|5.34B / 2.99B|2.77B / 3.67B|\n|**2024Q1**|4.68B / 10.25B|8.07B / 4.48B|3.60B / 4.39B|\n\n**Trend**:\n\n* GS: Long-term assets dominate, limiting liquidity flexibility. Short-term assets improved significantly in Q1 2024 but we also saw short-term debt grow so that makes sense. How can GS be fine financially but not pay Koehn on time? Here is your answer. Much of GS' value is in the players, facilities, and presumably other investments. \n* FB: Relies heavily on short-term assets, giving better liquidity but weaker asset stability. Since 2023, a move towards more long-term assets is discernible. Should FB invest more rather than hold cash? You decide. \n* BJK: Somewhat in between both clubs in terms of asset distribution. To be fair, it's kinda hard for BJK to inject new cash right now. They're doing what they can. \n\n  \n\n\n# Summary / TLDR\n\nWhat are the numbers telling us about the financial state of our clubs? Important: note that the numbers are up to date until March 2024, so towards the end of last season.   \n\n\n* **Overall**: While yes, the record debt looks scary, actually all clubs are **MORE financially stable** than a year or two ago. We all have reason to relax and enjoy a little. The overall trend for all 3 is positive and aside from growth in short-term debt, I don't see any numbers that are looking worse than last year for any of our clubs. As much as we like to hate and fear-monger, we should acknowledge that all our clubs are run by professionals and the numbers prove it. \n\n\n\n* **Galatasaray**: Financially arguably in the healthiest position of the 3, particularly revenues are really developing well. Their Board needs to decide: gamble on buying players like Osimhen and potentially improve revenues even more or use the current trends to stabilize and deleverage. Given these numbers, I have a feeling that spending big to achieve European success is possible. One thing to note is that they will need to find a good time to convert some of their long-term assets into cash. Otherwise, no Osimhen - but also, otherwise, that short-term debt could become dangerous. I assume that this short-term debt has only risen since March 2024, as GS has paid big for Sara and Sallai. \n* **Fenerbahçe**: FB is in a solid financial position. They're steadily improving. However, they'll need to figure out ways to earn more money FAST, if they don't want to fall too far behind GS. This might be why this season saw record investments in Mourinho and En-Nesyri. We will see how those affect the financial statements but Fenerbahce does need their investments to pay off. Fener did have a massive sale with Ferdi on the plus side. On another positive note, Fener appears to be the most liquid of the big 3 and I wouldn't be surprised if a deeper financial analysis would show that Fener is the least likely to go bankrupt of all clubs. \n* **Beşiktaş**: Kinda needs to focus on getting club finances in check. I'm surprised Immobile and Rafa happened tbh - I'm not sure how those two will have affected the financial outlook. We will have to wait for new numbers to be published. I personally expect 1 or 2 more difficult years ahead but nobody has been reducing their debt burden quite like you guys so kudos to professional management and turning the ship around! \n\n\n\nLook forward to your feedback guys! ",
        "subreddit": "superlig",
        "author": "Notyourregularthrow",
        "score": 104,
        "date": "2024-11-22 01:35:17"
    },
    {
        "title": "The current top scores of the Superlig as of 12th matchday",
        "body": "",
        "subreddit": "superlig",
        "author": "playerforlife123",
        "score": 40,
        "date": "2024-11-21 18:38:45"
    },
    {
        "title": "Dursun Özbek: \"If there is a structure in Turkish football, there is a structure against Galatasaray.\"",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 22,
        "date": "2024-11-21 10:05:11"
    },
    {
        "title": "FIFA Club World Cup 2025™ ",
        "body": "[https://inside.fifa.com/fifa-rankings/fifa-club-world-cup](https://inside.fifa.com/fifa-rankings/fifa-club-world-cup)\n\nI walked through the list of teams who are considered in the ranking.\n\nGalatasaray, Başakşehir and Beşiktaş are listed in the rankings.\n\nFIFA only considers the UEFA CL games, and it is a shame that both Trabzonspor and Fenerbahçe are not in the list.\n\nNo matter what, I hope Turkish teams will take part in this competition. \n\nI have very high hopes for the first one on 2025..",
        "subreddit": "superlig",
        "author": "mr-myxlptlk",
        "score": 5,
        "date": "2024-11-19 12:19:35"
    },
    {
        "title": "[Plettenberg] Victor Osimhen won’t leave Galatasaray in winter, the club is making serious efforts to keep him. Initial talks have taken place, Osimhen feels very comfortable at GS and has many friends there. His signals suggest that staying is an option, but it’s difficult. Price in summer: €75m",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 43,
        "date": "2024-11-16 14:39:01"
    },
    {
        "title": "Women's Süper Lig standings matchday 8",
        "body": "",
        "subreddit": "superlig",
        "author": "Antony2008Prime",
        "score": 28,
        "date": "2024-11-10 14:44:00"
    },
    {
        "title": "Samsunspor President: Fenerbahce should look at themselves. Everyone says they lost to a bunch of kiddos in UEL -- I was embarrassed for them. They keep telling that we'll kneel to Galatasaray. Galatasaray might crush us tomorrow but we'll be on the pitch to win or grab points. I expect a 1-1 score.",
        "body": "",
        "subreddit": "superlig",
        "author": "Swimming-Purchase-88",
        "score": 30,
        "date": "2024-11-10 06:17:38"
    },
    {
        "title": "European competitions predictions ",
        "body": "Since we have the halfway trough what are your predictions for our teams.\n\nMine would be \n\nGalatasaray in top 8. \n\nFenerbahce somewhere between 18-24 \n\nBesiktas somewhere between 12-20\n\nBasaksehir top 24 \n\n",
        "subreddit": "superlig",
        "author": "Scared_Ad_74",
        "score": 4,
        "date": "2024-11-08 06:26:22"
    },
    {
        "title": "Galatasaray 3-2 Tottenham",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 120,
        "date": "2024-11-07 19:48:29"
    },
    {
        "title": "Galatasaray [1] - 0 Tottenham - Yunus Akgün 6' (Harika gol)",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 35,
        "date": "2024-11-07 17:54:26"
    },
    {
        "title": "Yağız Sabuncuoğlu reports that Galatasaray is working to sign Victor Osimhen for 60-65 million euros by January, with funding support from multiple sponsors. Osimhen has stated, “If you secure my transfer, I’m ready to sign; I want to stay at Galatasaray.”",
        "body": "",
        "subreddit": "superlig",
        "author": "BelatedCube182",
        "score": 68,
        "date": "2024-11-06 20:39:55"
    },
    {
        "title": "Acun Ilıcalı: After long discussions with Galatasaray Club Board Member İbrahim Hatipoğlu, we have reached an agreement on the evaluation of the positions in the matches played by both teams this season by two foreign referees. All reports will be shared with the public during the NT break.",
        "body": "",
        "subreddit": "superlig",
        "author": "Jemal2200",
        "score": 17,
        "date": "2024-11-06 18:12:05"
    },
    {
        "title": "Süper lig current team ranking compared to Süper lig ranking of last 2 seasons till game week 10 ",
        "body": "2022/23 season was tight af till 10th game week",
        "subreddit": "superlig",
        "author": "Exact-Night5571",
        "score": 15,
        "date": "2024-11-04 05:50:17"
    },
    {
        "title": "Women's Süper Lig standings matchday 7",
        "body": "",
        "subreddit": "superlig",
        "author": "Antony2008Prime",
        "score": 27,
        "date": "2024-11-03 13:59:50"
    },
    {
        "title": "Kerem Akturkoglu #5 this season so far among the top scorers in Europe with 20 Goals + Assists in Benfica, Galatasaray and Turkish national team games. What an elite group he is in!",
        "body": "",
        "subreddit": "superlig",
        "author": "LegitimateCup8797",
        "score": 163,
        "date": "2024-10-31 17:59:26"
    },
    {
        "title": "Super Lig Best XI this season (as of Matchday 10) per Whoscored.com. Thoughts?",
        "body": "",
        "subreddit": "superlig",
        "author": "LegitimateCup8797",
        "score": 28,
        "date": "2024-10-30 15:41:52"
    },
    {
        "title": "0 - In his career, Ciro Immobile played his second match ever (among 218 90min matches) without taking a shot or touching the ball in the opponent’s penalty area against Galatasaray. Uncharacteristic.",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 86,
        "date": "2024-10-29 21:13:57"
    },
    {
        "title": "Galatasaray, which has by far the most possession in the opponent's penalty area in the Super Lig, is among the teams with the least penalties called",
        "body": "",
        "subreddit": "superlig",
        "author": "sorrysmurf",
        "score": 100,
        "date": "2024-10-29 15:36:39"
    },
    {
        "title": "First 10 weeks yellow card statistics of Beşiktaş, Fenerbahçe and Galatasaray according to majority opinion of Trio, Fırat Aydınus, Bünyamin Gezer and Deniz Ateş Bitnel.",
        "body": "",
        "subreddit": "superlig",
        "author": "Jemal2200",
        "score": 43,
        "date": "2024-10-29 15:21:12"
    },
    {
        "title": "As from Matchday 10, numbers of fouls per game, yellow card, and goals from penalty in Süper Lig",
        "body": "",
        "subreddit": "superlig",
        "author": "omerfe1",
        "score": 47,
        "date": "2024-10-29 12:28:37"
    },
    {
        "title": "Giovanni Van Bronckhorst maç ile ilgili açıklamaları:",
        "body": "",
        "subreddit": "superlig",
        "author": "neofthe",
        "score": 122,
        "date": "2024-10-28 20:00:17"
    },
    {
        "title": "Muçi‘s exceptional last minute goal isn‘t enough for BJK‘s comeback against Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 118,
        "date": "2024-10-28 19:03:03"
    },
    {
        "title": "Galatasaray 2 - [1] Besiktas - E. Muçi 90+4' (Wonderful Strike)",
        "body": "",
        "subreddit": "superlig",
        "author": "BeautifulAlert5740",
        "score": 20,
        "date": "2024-10-28 19:01:39"
    },
    {
        "title": "Match Thread: Galatasaray vs Beşiktaş [Süper Lig]",
        "body": "",
        "subreddit": "superlig",
        "author": "manmadegod-",
        "score": 19,
        "date": "2024-10-28 16:50:34"
    },
    {
        "title": "Galatasaray muhtemel 11 (derby) | Muslera, Barış Alper, Abdülkerim, Davinson, Kaan, Sallai, Torreira, Sara, Yunus, Osimhen, Icardi.",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 15,
        "date": "2024-10-28 09:49:38"
    },
    {
        "title": "Galatasaray Tarihinin En Golcü 3 Yabancı Futbolcusu",
        "body": "",
        "subreddit": "superlig",
        "author": "Draqul1",
        "score": 119,
        "date": "2024-10-26 11:41:47"
    },
    {
        "title": "Number of yellow cards of Turkish Teams in Europa League",
        "body": "",
        "subreddit": "superlig",
        "author": "omerfe1",
        "score": 214,
        "date": "2024-10-25 15:11:02"
    },
    {
        "title": "Europa League table after 3 matches",
        "body": "",
        "subreddit": "superlig",
        "author": "Jemal2200",
        "score": 146,
        "date": "2024-10-24 22:00:34"
    },
    {
        "title": "Women's Süper Lig standings",
        "body": "",
        "subreddit": "superlig",
        "author": "Antony2008Prime",
        "score": 58,
        "date": "2024-10-23 20:04:47"
    },
    {
        "title": "Galatasaray win 4-3 at home against Elfsborg in the Europa League matchday 3.",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 154,
        "date": "2024-10-23 16:26:00"
    },
    {
        "title": "Yunus Akgün has been referred to PFDK for his Instagram post, will miss derby if punished",
        "body": "",
        "subreddit": "superlig",
        "author": "evetttt",
        "score": 81,
        "date": "2024-10-22 17:47:05"
    },
    {
        "title": "Antalyaspor 0 - [3] Galatasaray - Victor Osimhen 90+3'",
        "body": "",
        "subreddit": "superlig",
        "author": "kastamonu34",
        "score": 68,
        "date": "2024-10-19 18:07:32"
    },
    {
        "title": "Next Generation 2024: 60 of the best young talents in world football born in 2007. Turkish players on the list: Ege Araç (Galatasaray), Mustafa Erhan Hekimoğlu (BJK).",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 31,
        "date": "2024-10-15 14:50:34"
    },
    {
        "title": "I asked ChatGPT to roast /r/superlig",
        "body": "",
        "subreddit": "superlig",
        "author": "gorgonizedbyurTITS",
        "score": 61,
        "date": "2024-10-10 17:55:49"
    },
    {
        "title": "[Poll Results] Which Super Lig team has caused the most stress to their fans this season.",
        "body": "https://preview.redd.it/5utar7pcljtd1.png?width=1208&amp;format=png&amp;auto=webp&amp;s=bcdd610e10026d59168db037895828cbac13047f\n\n",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 36,
        "date": "2024-10-08 14:26:39"
    },
    {
        "title": "After the last matchday before NT break, these are the top 10 teams in the SL table",
        "body": "Also to mention: Galatasaray, Beşiktaş and Trabzonspor (👏💪) are the only teams without a loss",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 51,
        "date": "2024-10-06 18:08:05"
    },
    {
        "title": "[Transfermarkt] Most valuable teams in the Superlig",
        "body": "",
        "subreddit": "superlig",
        "author": "77SidVid77",
        "score": 44,
        "date": "2024-10-05 08:58:19"
    },
    {
        "title": "Milli Takım aday kardosu açıklandı",
        "body": "",
        "subreddit": "superlig",
        "author": "benimolmcan",
        "score": 65,
        "date": "2024-10-04 09:49:38"
    },
    {
        "title": "Türk Takımlarının Bu Hafta Avrupa'daki Sonuçları",
        "body": "* Basaksehir 1 - Rapid Wien 2\n* FC RFS 2 - Galatasaray 2\n* Besiktas 1 - Eintracht Frankfurt 3\n* Twente 1 - Fenerbahce 1\n\n0 galibiyet, 2 beraberlik, 2 mağlubiyet\n\nHepimize başsağlığı diliyorum.",
        "subreddit": "superlig",
        "author": "gorgonizedbyurTITS",
        "score": 24,
        "date": "2024-10-03 21:02:43"
    },
    {
        "title": "FC RFS 2 - 2 Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 88,
        "date": "2024-10-03 18:41:30"
    },
    {
        "title": "[Match Thread] RFS vs Galatasaray",
        "body": "Venue: Daugavas Stadions\n\n\n\nLINE-UPS\n\n\n\nRigas Futbola Skola (Latvia)\n\n\n\nFabrice Ondoa, Ziga Lipuscek, Herdi Prenga, Haruna Njie, Roberts Savalnieks, Janis Ikaunieks, Stefan Panic, Adam Markhiev, Rostand Ndjiki, Alain Cedric Herve Kouadio, Lasha Odisharia.\n\n\n\nSubs: Sergejs Vilkovs, Dmitrijs Zelenkovs, Darko Lemajic, Pavels Steinbors, Victor Osuagwu, Petr Mares, Martins Kigurs, Luka Silagadze, Elvis Stuglis, Daniels Balodis.\n\n\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n\n\nGalatasaray\n\n\n\nGünay Güvenc, Abdülkerim Bardakci, Davinson Sánchez, Ismail Jakobs, Kaan Ayhan, Dries Mertens, Gabriel Sara, Lucas Torreira, Mauro Icardi, Baris Alper Yilmaz, Yunus Akgün.\n\n\n\nSubs: Atakan Ordu, Elias Jelert, Efe Akman, Berkan Kutlu, Victor Nelsson, Berat Lus, Michy Batshuayi, Kerem Demirbay, Metehan Baltaci, Batuhan Ahmet Sen, Halim Yükseloglu, Yusuf Demir.\n\n\n\nhttps://preview.redd.it/9avqaiszfksd1.jpg?width=217&amp;format=pjpg&amp;auto=webp&amp;s=d848536ed7afb181ce89cb4122ab34e91bddb62e\n\n",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 12,
        "date": "2024-10-03 16:13:52"
    },
    {
        "title": "“If Osimhen leaves GS in January, Napoli will pay 6.5€ compensation to GS.” [Transfermarkt]",
        "body": "",
        "subreddit": "superlig",
        "author": "theSWW",
        "score": 50,
        "date": "2024-10-02 20:21:55"
    },
    {
        "title": "Süper Lig Tabela after GW7",
        "body": "",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 54,
        "date": "2024-09-30 20:59:24"
    },
    {
        "title": "Insane Scenes! Kasımpaşa complete a 3-0 comeback on Galatasaray in RAMS park.",
        "body": "",
        "subreddit": "superlig",
        "author": "BeautifulAlert5740",
        "score": 195,
        "date": "2024-09-28 18:05:36"
    },
    {
        "title": "Disgusting team from Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "Wonderful-Lack3846",
        "score": 146,
        "date": "2024-09-28 17:36:46"
    },
    {
        "title": "Galatasaray [3] -0 Kasimpasa - Mauro Icardi 34' GOLAZO",
        "body": "",
        "subreddit": "superlig",
        "author": "Whatsgood_2002",
        "score": 23,
        "date": "2024-09-28 17:02:24"
    },
    {
        "title": "Fikstürlerine Kıyasla Süper Lig Takımları Ne Kadar Başarılı Oldu [İlk 6 Hafta]",
        "body": "https://preview.redd.it/rk00znc2ygrd1.png?width=1080&amp;format=png&amp;auto=webp&amp;s=60d155275d8877789c0a92b2554ebf773ecd79bc\n\n* Gaziantep en zorlu fikstüre sahip takımdı. (5 ve 7 maç yapmış takımları çıkarırsak Rizespor.)\n* Galatasaray en kolay fikstüre sahip takımdı.\n* Adana Demirspor en dengeli fikstüre sahip takımdı.\n* \"Herhangi bir Süper Lig takımı\"na kıyasla en iyi sonuçları Beşiktaş aldı. (5 ve 7 maç yapmış takımları çıkarırsak Eyüpspor.)\n* \"Herhangi bir Süper Lig takımı\"na kıyasla en kötü sonuçları Kasımpaşa aldı.\n* Trabzonpor*,* \"Herhangi bir Süper Lig takımı\"na en benzer sonuçları aldı. (5 ve 7 maç yapmış takımları çıkarırsak Fenerbahçe.)\n\nGrafik hangi takımın daha iyi oynadığını değil; Süper Lig ortalamalarına ve \"Herhangi bir Süper Lig takımı\" isimli, aldığı sonuçların Süper Lig trendine uygun olduğu varsayılan hayali bir takıma kıyasla takımınızın sergilediği performansı gösteriyor.\n\n\n\n*Veriler SofaScore'dan alınıp Excel'de harmanlandı.*\n\n\n\n*\\*: 5 maç yapmış takımlar.*\n\n\n\n*\\*\\*: 7 maç yapmış takımlar.* ",
        "subreddit": "superlig",
        "author": "baychowski",
        "score": 24,
        "date": "2024-09-28 04:44:53"
    },
    {
        "title": "Europa league Tabela after GW1",
        "body": "",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 112,
        "date": "2024-09-27 13:37:35"
    },
    {
        "title": "Big 3 Fixture (~end of Jan. '25) ",
        "body": "",
        "subreddit": "superlig",
        "author": "kawaiiOzzichan",
        "score": 35,
        "date": "2024-09-27 02:56:22"
    },
    {
        "title": "Galatasaray defeated PAOK 3-1 at home. ",
        "body": "",
        "subreddit": "superlig",
        "author": "BelatedCube182",
        "score": 270,
        "date": "2024-09-25 21:00:55"
    },
    {
        "title": "Galatasaray overcome Slavia Prague and qualify for the Women’s Champions League",
        "body": "",
        "subreddit": "superlig",
        "author": "miyazakipls",
        "score": 97,
        "date": "2024-09-25 18:44:24"
    },
    {
        "title": "[Match Thread] Galatasaray vs PAOK  -  Europa League",
        "body": "Lineup:\n\nhttps://preview.redd.it/acfykelq00rd1.png?width=1268&amp;format=png&amp;auto=webp&amp;s=18c6b686cc20f198d00f6cb25444b322a47fe19d\n\n  \n",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 18,
        "date": "2024-09-25 18:31:08"
    },
    {
        "title": "[Opta Analyst] 2024/25 UEFA Europa League odds",
        "body": "",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 17,
        "date": "2024-09-24 18:29:18"
    },
    {
        "title": "[Football Meets Data] 2024/25 UEFA Europa League odds as of September 23rd (10.000 Elo-based simulations)",
        "body": "",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 20,
        "date": "2024-09-23 15:10:10"
    },
    {
        "title": "[De Marke Sports] Jose Mourinho did not attend the press conference, after loosing 1-3 to Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 63,
        "date": "2024-09-21 20:19:46"
    },
    {
        "title": "Fenerbahçe 1-3 Galatasaray",
        "body": "FB 1-3 GS",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 85,
        "date": "2024-09-21 19:04:06"
    },
    {
        "title": "Match Thread: Fenerbahçe- Galatasaray",
        "body": "Feel free to discuss ",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 29,
        "date": "2024-09-21 16:12:40"
    },
    {
        "title": "Match Discussions: Süper Lig - Week 6",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 10,
        "date": "2024-09-20 17:21:43"
    },
    {
        "title": "Imagine all stadiums are filled like this ( Besiktas is shown twice)",
        "body": "",
        "subreddit": "superlig",
        "author": "Trapzed_61",
        "score": 37,
        "date": "2024-09-19 08:15:49"
    },
    {
        "title": "Cant we just accept the REFs are poor? ",
        "body": "\nI am a Galatasaray fan. I try to stay away from all kinds of politics and issues other than football in Turkey – so maybe my knowledge is lacking, sorry in advance. \n\nAnyway the derby REF is announced and in most football countries and/or r//subs there is maybe 1 post about it. This also included Juve sub or Real/Barca etc.\n\nWith us there are multiple posts past days on Fener and GS reddits…\n\nEven funnier; at the Fener sub everyone says “ah we get 4 red cards GA have fixed the game”. \n\nAT THE SAME TIME at the GS subs a post that says “according to statistics, this referee supports Fenerbahçe” with 75% of thr sub agreeing.\n\n Like wtf. Same referee, its this not weird and contradicting. Also BJK and Trabzon and Konya are backed by TFF according to others. Like how is this ever possible? \n\nIs it not more logical to assume the REFs are just very poor, like the rest of the TFF quality - and just make mistakes? When are we gonna stop with this craziness and trio’s etc etc?\n\nWhat do you think? REFs poor or conspiracy that all teams have all REFs pocketed?",
        "subreddit": "superlig",
        "author": "BlackMambaTR",
        "score": 54,
        "date": "2024-09-18 18:07:20"
    },
    {
        "title": "[Yagiz]Fenerbahçe, Galatasaray'ı devlet kurumlarına ve TFF'ye şikayet etti. • Oyuncu maaşlarını düşük göstermek • Karaborsa bilet satışı ile haksız gelir • Illegal bahis şirketlerinin reklamı",
        "body": "",
        "subreddit": "superlig",
        "author": "JCBDoesGaming",
        "score": 98,
        "date": "2024-09-18 16:00:11"
    },
    {
        "title": "Galatasaray fans applaud Gaziantep F.K.’s Furkan Soyalp after he scored from the halfway line ",
        "body": "",
        "subreddit": "superlig",
        "author": "shadwocorner",
        "score": 133,
        "date": "2024-09-18 07:14:04"
    },
    {
        "title": "Some stats (Week 5)",
        "body": "",
        "subreddit": "superlig",
        "author": "omarny",
        "score": 0,
        "date": "2024-09-18 07:04:13"
    },
    {
        "title": "Süperlig fixtures for weeks 7-16",
        "body": "",
        "subreddit": "superlig",
        "author": "enisd1905",
        "score": 12,
        "date": "2024-09-16 15:04:20"
    },
    {
        "title": "How to buy ticket ?",
        "body": "Hello i'm foreigner and right now i'm in turkey and i'll be leaving soon and i really want  to attend tomorrow's galatasary match\n i applied for the passolig card (for Galatasaray)and they told me to get it from the stadium and i'm planning to get before the match tomorrow.\nbut the problem is now i want to buy the ticket from passo and it's telling me my passolig card does not comply and i can't buy the ticket \nplease anyone can help me with this what should i do ?\nplease note that i have no how to use passo or buying tickets in general\nthank you in advance ",
        "subreddit": "superlig",
        "author": "klay_14",
        "score": 5,
        "date": "2024-09-16 15:01:35"
    },
    {
        "title": "Tickets for Galatasaray - Gazientep",
        "body": "I have 2 tickets for Galatasaray - Gazientep. Anyone now where I can sell them?",
        "subreddit": "superlig",
        "author": "SlightMaintenance769",
        "score": 0,
        "date": "2024-09-16 08:49:55"
    },
    {
        "title": "How the Süper Lig table could change in week 5",
        "body": "",
        "subreddit": "superlig",
        "author": "terterburnur",
        "score": 19,
        "date": "2024-09-14 12:06:04"
    },
    {
        "title": "Sabuncuoğlu: Muriqi agreed on going to Galatasaray and insisted on playing for Galatasaray for the Champions League and Fatih Terim. But, after some politicians’ phone calls, the tide turned towards Fenerbahçe ",
        "body": "https://x.com/deparsports/status/1834709367037325329?s=46",
        "subreddit": "superlig",
        "author": "ugurcanevci",
        "score": 27,
        "date": "2024-09-13 23:51:16"
    },
    {
        "title": "About GS and yellow cards ",
        "body": "Hey everyone, in the last season, a theory about GS being boosted by TFF by not receiving yellow cards became quite popular. I still see posts about this *FREQUENTLY* in certain subreddits, so I would like to share my thoughts on the topic. Feel free to agree or disagree but I think a discussion forum would be useful. \n\nIn the following, I’ll refer to stats and football from the 2023-2024 season, as we don’t have a statistically meaningful number of games in this season yet. We can evaluate again at the end of this season. I will also directly contrast GS with its closest rival FB, because that’s what is usually done when this topic is raised. \n\n**So why did GS receive fewer cards per foul - than many others in general and FB specifically?**\n\nGS plays possession football with pressing high up front. Much more than FB. Offensive fouls receive significantly fewer cards than defensive ones because they’re typically not tactical and not stopping (clear) goal chances. Unlike FB, GS was also almost never behind this season, which means there simply was less need or urgency for tactical fouls. Unlike FB, GS also had no \"incidence games\" like the FB games against Trabzon that were just wild. GS also does not have physically dominant players like FB does - so playing less physical football is to be expected. Therefore, FB having more yellows at the end of the season than GS is expected.\n\n**Is the GS statistic a unique anomaly?**\n\nDo we see similar stats with other dominant, possession football teams in the world? Yes - Liverpool had the *third fewest yellow cards* in the Premier League despite having the *third most fouls per game* as per fotmob data (2023/2024). Do we see similar discussions about Liverpool?\n\nEvery GS fans favorite team Young Boys had the *MOST* fouls per game in the Swiss league yet was *9th (out of 12) in yellow cards conceded*. In other leagues, you will see the most dominant team typically either committing the least fouls or committing a significant number of fouls but in every case with very few yellows. The opposite? I wouldn’t know of a single league. \n\nIn other words: the number of cards can EASILY be explained away by the type of fouls, the timing of the game at which they occur (i.e. in the lead, under pressure), and the domination of the games GS played. It is TYPICAL around the world for dominant teams to receive fewer yellows - it’s very much in line with what we see in other leagues. This, by the way, also gives a very plausible, non-fanatic explanation for why GS receives so many more cards in Europe. The opponents are better. If a team dominates you, you resort to more physical football, make more fouls, and some of them will clearly be last attempts at stopping a player who otherwise has you beat. Thus..cards.  *The sad truth is that GS isn’t competitive in the CL*. \n\nBut the story doesn’t end here. Let’s not forget that a foul call always means that the ball is taken away from you and given to the opponent. Thus, you being fouled, means you getting or retaining the ball. This brings me to the flip side of this argument nobody is talking about. \n\n**Flip side to the coin: FB receives many more foul calls in their favor.**\n\nGS gets the *15th* (think about that!) least foul calls in their favor, despite having *most possession*. How does that make sense, who can explain this? You can literally (almost) only be fouled when you’re in possession. And yet, referees believed that 14 teams in the super lig got fouled more than GS. And in direct contrast, guess who gets fouled the most? Exactly, FB. Throughout the season, no team got the ball handed to by the refs more than FB. \n\nGS fans, throughout the season, were losing hair over how opponent players take the ball away from them by foul means and the referee does nothing. This statistic supports their claim. Yet, in certain forums I keep  on seeing comments like \"if this was a GS player, it would have been a foul\"?\n\nI don’t believe in a TFF conspiracy. I just think that some refs may be swayed by home atmospheres, some may be biased, but most importantly, many are just incompetent and fall for player theatrics. I also believe that the difference in statistics of last year are mostly due to different styles of football (and football players).\n\nThe point I want to make is that people who only look look at the yellow cards and scream conspiracy not only misunderstand the meaning of this statistic, ignore (or never look up) the truth of what football looks like all around the world, but also cherry pick only the numbers that suit their cause. Please, stop. \n\nSome of my sources below - feel free to help me find better sources or correct what I'm saying. :)\n\n[Fouls per match](https://www.fotmob.com/leagues/71/stats/season/21459/teams/fk_foul_lost_team/team/8637/galatasaray-teams)\n\n[Yellow cards](https://www.fotmob.com/leagues/71/stats/season/21459/teams/total_yel_card_team/team/8637/galatasaray-teams)\n\n[Liverpool fouls](https://www.fotmob.com/leagues/47/stats/season/20720/teams/fk_foul_lost_team/team/8586)\n\n[Bayern fouls](https://www.fotmob.com/leagues/54/stats/season/23794/teams/fk_foul_lost_team/team/9823/bayern-munchen-teams)\n\n[Young Boys fouls](https://www.fotmob.com/teams/10192/stats/young-boys/teams)\n\n[Fouls committed vs Fouls Drawn ](https://www.thepunterspage.com/fouls-stats/)",
        "subreddit": "superlig",
        "author": "Notyourregularthrow",
        "score": 0,
        "date": "2024-09-13 13:09:43"
    },
    {
        "title": "Match Discussions: Süper Lig - Week 5",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 11,
        "date": "2024-09-13 07:00:25"
    },
    {
        "title": "Passolig: Galatasaray - Gaizantep",
        "body": "Hey, I want to buy ticket for following match, I know I have to create 2 accounts and also had to buy Turkish sim, because I can't create account with polish number, but I've other questions.\n\n1. Are there still free tickets for these match? (I can't check it and I don't know if there is any sense of creating card). Would it be possible to get 7-8 cat ticket 1-2 days before match?  \n2. Can I buy ticket if I have passolig card with another club logo (Antalyaspor)?  \n3. I know 1 user can buy 2 tickets, but still the 2nd person to whom I've bought ticket has to have the passolig card?  \n\n\nCheers",
        "subreddit": "superlig",
        "author": "Jan_Rodzen",
        "score": 3,
        "date": "2024-09-12 18:20:04"
    },
    {
        "title": "No context",
        "body": "Just kidding, both E. Topçu named players neither are related in any way nor married to each other",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 39,
        "date": "2024-09-11 17:39:55"
    },
    {
        "title": "Estimated earnings for qualifying for Europa league",
        "body": "",
        "subreddit": "superlig",
        "author": "watchgrabber",
        "score": 17,
        "date": "2024-09-10 19:53:40"
    },
    {
        "title": "Our fans are the Problem of our league ",
        "body": "There are so many problems of our league but for me the biggest one are our „fans“.\n\nLiterally kerem showed today why this is so true. We are so impatient with the players, managers, boards, doctors, transfers and so more things. We never trust a process and want immediate success and even when we are successful we are finding something to be bothered. \n\nLet me start with the „big 4“ \n\nGalatasaray: Bad start into the season, fire board, manager and sell like almost all players (even icardi) was the big consens in the gala sub. \n\nFenerbahce: fought like lions against Lille and was unlucky to get eliminated than mou is washed, Dzeko should be sold, tadic can’t play good, Jayden is shit on the left and and and. \n\nBesiktas: Great start into the season, we will be champions, we are the best, there is not even a competition in this league for us, we will win the europa league. If their fans would be on the board one of the biggest reasons why they have success (Gedson) wouldn’t be in this team anymore and ao many more. \n\nTrabzon: let’s burn the world. \n\nLike what I want to say is we can’t control our feelings and cannot be patient or trust the process cause our emotions are controlling us. We are saying that our boards are making panic transfers or they are acting populist but we don’t see that we are the main reason why they do what they are doing. \n\n\nWe fucking sold KEREM AKA THE WIZARD only cause of our shitty fans for peanuts in a world where all wingers who can just run straight ahead are worth 20m at least. \n\nWe need to calm down and give the things the time which they need but I am pretty sure that at the end of the season 2 out of the 3 big Istanbul teams will not have the same coach next year cause Second place is a failure and don’t let me start with the third place. \n\nIt’s just sad that we can’t control our emotions and invest into the future.",
        "subreddit": "superlig",
        "author": "Scared_Ad_74",
        "score": 27,
        "date": "2024-09-09 22:26:20"
    },
    {
        "title": "Fenerbahce vs Galatasaray ",
        "body": "How to get match tickets online knowing that they are not available on passo?",
        "subreddit": "superlig",
        "author": "rxnonn",
        "score": 1,
        "date": "2024-09-07 16:20:33"
    },
    {
        "title": "Çare",
        "body": "Getirin Ismail hocayi su takimin basina. \n\nBu is mozzarella nutellayla olmaz. Bana hic kimse ceyrek final oynadik demesin. Match thread’de dedigim gibi, hangi macta ne anlamli hamle yapip mac kazandirdi?? Hatta Hollanda macini degisiklikte gec kaldigi icin kaybettik. \n\nFenerli arkadaslar daha iyi bilir ama ben gercekten Ismail hocayi begeniyorum. Adam derbileri kazanir. Trabzonun sampiyon oldugu sezon Fenerin basina gecip mac kaybetmemisti (fact check me on this actually) ama malasef yabanci asikligi Dede Jesusu getirip 1 senesini yedi. Gecen sezon geri getirilip zaten yaptigi belli. Derbi kaybetmedi ve sampiyonlugu 99 puan toplayip 3 puanla kaybetti. Tamam Olympiakos macinda kotu yonetti ama ders felan cikartmistir. Bizim Okan kac buyuk mac yenilgisinden beri hala cikartamiyor. \n\nBence super ligin ve Fener Galatasaray toksikliginden uzak durup Turkiye milli takimini cok durustce ve iyi yonetir. Yanina 2-3 tane uzman yardimci antrenor getirilsin, torpil felan degil, ve bak gorun milli takimi. \n\nEn azindan bi “identity” felan getirir su takima. Ne oynadigimiz, nasil oynadigimiz belli olur. \n\nDusunceleriniz nedir arkadaslar? ",
        "subreddit": "superlig",
        "author": "gorgonizedbyurTITS",
        "score": 168,
        "date": "2024-09-06 22:10:28"
    },
    {
        "title": "[Sports Digitale] A criminal complaint has been filed to the office of the Chief Public Prosecutor in Istanbul by Rezan Epözdemir about the alleged black market home ticket sales by Galatasaray.",
        "body": "",
        "subreddit": "superlig",
        "author": "AspergerKid",
        "score": 40,
        "date": "2024-09-06 21:59:21"
    },
    {
        "title": "Galatasaray Women’s team begin their Champions league journey with a 2-0 lead at half time. Could we see a Turkish women’s team in the UCL?",
        "body": "",
        "subreddit": "superlig",
        "author": "polatcurekli",
        "score": 25,
        "date": "2024-09-04 17:52:30"
    },
    {
        "title": "Galatasaray announce Victor Osimhen",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 61,
        "date": "2024-09-04 16:29:50"
    },
    {
        "title": "No Transfers for the Big 3 Today? ",
        "body": "I was just curious, 7 Hours till the UEL-List closes &amp; still no Transfers for Galatasaray, Fenerbahce &amp; Besiktas. \nAll these Clubs desperately need new Transfers…",
        "subreddit": "superlig",
        "author": "Icy-Ground1222",
        "score": 6,
        "date": "2024-09-04 15:05:08"
    },
    {
        "title": "When is Fenerbahçe vs Galatasaray? ",
        "body": "One site says september 22nd and other says september 21st 10pm IST time? \n\n\n\n",
        "subreddit": "superlig",
        "author": "psychoxtc",
        "score": 0,
        "date": "2024-09-04 14:37:20"
    },
    {
        "title": "I rated fans all over Istanbul",
        "body": "I went to games all over Istanbul and here is my rating of the fans that I've seen, from worst to best, tell me your opinions.\n\nİstanbul Başakşehir FK - Pretty much Non existent; and the ones that exist are political\n\nIstanbulspor - Non existent aswell but the ones that exist are usually not political and Istanbul Erkek Lisesi students\n\nBaşakşehirspor - True Başakşehir folk support this rather IBFK. Still not good\n\nTuzlaspor - I mean the people that go to the games are passionate but they dont deserve SüperLig\n\nPendikspor - Now I lived in Pendik for a lot of time and I can easily say that Pendik folk love Pendikspor but the fans dont deserve SüperLig.\n\nKasımpaşa - Same as Pendik, passionate but dont deserve SüperLig\n\nFatih Karagümrük - Eternal rivals of Pendik. Karagümrük folk are also passionate. Maybe they would be better if they had a Stadium there but still dont deserve SüperLig.\n\nBeykoz - Shame that they are in the Süper Amatör Lig. Would deserve süperlig if they had a better stadium but they are too violent.\n\nFenerbahçe - They were better but not now. Still good for SüperLig.\n\nGalatasaray - One of the best tifos in the world are made bu Galatasaray fans. But the number one spot goes to\n\nBeşiktaş - Best percussion, best chants and best Stadium. Their tifos though even Altay is better in that topic.\n\nRemember, this is my subjective opinion and they are the ones that I witnessed. Tell me your opinions.",
        "subreddit": "superlig",
        "author": "Practical-Line-498",
        "score": 21,
        "date": "2024-09-04 11:45:57"
    },
    {
        "title": "POV: Yanlışlıkla Galatasaray Lisesi'nin bodrum katına indin...",
        "body": "",
        "subreddit": "superlig",
        "author": "Nusturak",
        "score": 448,
        "date": "2024-09-03 12:21:23"
    },
    {
        "title": "Galatasaray announces Victor James Osimhen",
        "body": "",
        "subreddit": "superlig",
        "author": "Biltema",
        "score": 81,
        "date": "2024-09-02 21:57:01"
    },
    {
        "title": "[Fabrizio Romano] Victor Osimhen to Galatasaray, here we go! Deal done and all documents have been approved. Osimhen’s release clause will be €75m with Napoli option to extend until 2027. Loan move to Gala until June 2025, €9/10m salary covered. No buy option, no obligation",
        "body": "",
        "subreddit": "superlig",
        "author": "TheBiasedSportsLover",
        "score": 79,
        "date": "2024-09-02 21:41:10"
    },
    {
        "title": "Similar things",
        "body": "",
        "subreddit": "superlig",
        "author": "hknyktx",
        "score": 33,
        "date": "2024-09-02 21:01:09"
    },
    {
        "title": "[Yağiz] Napoli, Galatasaray'ın Victor Osimhen için yaptığı teklifi kabul etti. Galatasaray yönetimi, Osimhen ile bu akşam görüşecek.",
        "body": "",
        "subreddit": "superlig",
        "author": "sentyprimus",
        "score": 48,
        "date": "2024-09-02 14:39:29"
    },
    {
        "title": "Every Europa League fixture of the big 3 in one picture",
        "body": "League Phase",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 90,
        "date": "2024-09-02 12:22:06"
    },
    {
        "title": "Europa League probabilities (according to 10000 ELO-based simulations)",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 85,
        "date": "2024-09-01 08:23:04"
    },
    {
        "title": "Deniz Donmezer (Adana Demirspor) penalty save against Galatasaray 90'",
        "body": "",
        "subreddit": "superlig",
        "author": "RoboticCurrents",
        "score": 19,
        "date": "2024-08-31 20:43:01"
    },
    {
        "title": "Adana Demirspor 0-1 Galatasaray - Kerem Akturkoglu 9' (15 YO Goalie Makes an unfortunate mistake) ",
        "body": "",
        "subreddit": "superlig",
        "author": "BeautifulAlert5740",
        "score": 16,
        "date": "2024-08-31 19:14:21"
    },
    {
        "title": "The teams with the most difficult draw in the Europa League stage, measured by the opponents' coefficient and ELO ranking",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 117,
        "date": "2024-08-31 14:05:02"
    },
    {
        "title": "SL Teams with the most red cards in Europe",
        "body": "- Since 2001\n\n- Double yellow cards included",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 57,
        "date": "2024-08-31 11:33:26"
    },
    {
        "title": "Average UEFA Coefficient of each Europa League participant's opponents",
        "body": "",
        "subreddit": "superlig",
        "author": "u8kay",
        "score": 20,
        "date": "2024-08-30 12:59:21"
    },
    {
        "title": "Which teams do you think will finish in the top 8? There are also teams such as Slavia Prague Olympiacos that are not visible in the image.",
        "body": "",
        "subreddit": "superlig",
        "author": "shnshhsnsbbh",
        "score": 12,
        "date": "2024-08-30 12:50:34"
    },
    {
        "title": "Europa League League Stage Draw results for the big 3",
        "body": "",
        "subreddit": "superlig",
        "author": "u8kay",
        "score": 143,
        "date": "2024-08-30 11:47:24"
    },
    {
        "title": "„4 büyüklerin“ most matches against euopean teams ",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 130,
        "date": "2024-08-30 10:14:54"
    },
    {
        "title": "Why is Fener in Pot 2 and Galatasaray in Pot 3?",
        "body": "",
        "subreddit": "superlig",
        "author": "HannibalBarca20",
        "score": 0,
        "date": "2024-08-29 22:38:19"
    },
    {
        "title": "Bütün büyüklerde karaborsa çok güçlü mü?",
        "body": "Şu an Galatasaray hakkında bir çok kişi biletlerin direk karaborsaya verildiğini söylüyor, aynı şey Fenerbahçe / Beşiktaş için de geçerli mi?",
        "subreddit": "superlig",
        "author": "peterpansdiary",
        "score": 5,
        "date": "2024-08-28 17:20:58"
    },
    {
        "title": "Projected UEL pots ",
        "body": "How far do you think our clubs can go?",
        "subreddit": "superlig",
        "author": "Little-Delay-2616",
        "score": 70,
        "date": "2024-08-27 22:48:57"
    },
    {
        "title": "Galatasaray lose to Young Boys and will continue their season in the Europa League.",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 132,
        "date": "2024-08-27 21:01:42"
    },
    {
        "title": "Match Thread: Galatasaray - Young Boys Bern",
        "body": "First leg: YBB 3-2 GS",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 15,
        "date": "2024-08-27 18:57:49"
    },
    {
        "title": "galatasaray’ın young boys maçı biletleri nasıl hem satıştan 2 saat sonra tükenip, maç günü hala mevcut olabiliyor?",
        "body": "",
        "subreddit": "superlig",
        "author": "tarkology",
        "score": 13,
        "date": "2024-08-27 13:36:38"
    },
    {
        "title": "🚨 Several clubs, notably Fenerbahçe and Galatasaray, asked for an increase in the '+2' quota of foreign players sitting in the stands in the 12+2 foreign rule because they cannot get rid of foreign players they do not use, but this request was rejected by the TFF.",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 51,
        "date": "2024-08-27 12:12:58"
    },
    {
        "title": "Passolig card ",
        "body": "Hello everyone,\n\nDoes anyone now why it’s not possible to apply for Passolig card? I’m a foreigner in Turkey - tried with my phone number and with hotel’s stuff phone number (Turkey) and nothing works. They just navigate to home page.\n\nI need to get my tickets for Galatasaray match that I bought via Viagogo webpage.",
        "subreddit": "superlig",
        "author": "SlightMaintenance769",
        "score": 0,
        "date": "2024-08-22 20:01:35"
    },
    {
        "title": "last 30/40 games of the big three im UCL",
        "body": "source: https://x.com/ulkepuan/status/1826633033623158938?s=46&amp;t=7vvmldEtyCcMK6J1mXbKEQ",
        "subreddit": "superlig",
        "author": "gogosch",
        "score": 40,
        "date": "2024-08-22 15:00:38"
    },
    {
        "title": "Young Boys Bern 3-2 Galatasaray",
        "body": "First like YBB wins 3-2",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 28,
        "date": "2024-08-21 21:01:43"
    },
    {
        "title": "Match Thread: Young Boys Bern - Galatasaray",
        "body": "First leg between YBB - GS",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 6,
        "date": "2024-08-21 18:33:33"
    },
    {
        "title": "Top spenders over the last 10 seasons. [20.08.24]",
        "body": "",
        "subreddit": "superlig",
        "author": "eanwen0",
        "score": 91,
        "date": "2024-08-20 14:11:32"
    },
    {
        "title": "Thing I remember watching Turkish soccer in '80s and '90s",
        "body": "I noticed the sub skews younger, so I thought I'd share some of my experiences watching Turkish soccer in the late '80s and '90s that some of you might not have known and may find interesting. (Other elders like me, feel free to add.)\n\n(It should say things. Can't edit the title)\n\n\\*It became SuperLig in 2000. It was \"Birinci Lig\" before.\n\n\\*Almost all stadiums had fences separating the stands from the field. I think Fenerbahce was among the first to dismantle them after renovating the stadium around 2000.\n\n\\*Players were often referred to with first names. Many fans wouldn't even know the last names of players.\n\n\\*Players with the same name on the same team would be identified as \"Büyük\" or \"Küçük”depending on their age. Latest example of this I remember was Büyük Hakan (Sukur) and Küçük Hakan (Unsal). This fell out of fashion in late 1990s.\n\n\\*Until 2000-01 season, there were no assigned squad numbers. Starters wore numbers 1-11 and subs wore 12 to 16 (later to 18 when number of bench players available went from 5 to 7) with no names on the back. You may see the odd highlight reel of Hagi wearing number 15 or 17 because of that (when he entered as a sub.)\n\n\\*Reporters would literally jump in from sidelines during a game to do interviews. Some legendary moments came out of these interviews like Fenerbahce's Engin saying \"Hakem bana pezevenk dedi\" or Galatasaray's Hayrettin claiming he was going to \"end Ridvan\"\n\n  \n\\*Fenerbahce was the undisputed great of the league. Every celebrity, every major public figure, most sports journalists were Fener fans. In the movie Hababam Sinifi, writers made all the characters Fener fans, such was Fener's cultural dominance. Milliyet, the second or third biggest paper at the time, didn't have a single reporter who was a Galatasaray fan, their Galatasaray reporter was Halil Ozer, a well-known Fener supporter. Before Galatasaray's four in a row titles they had 10 to Fener's 13.\n\n\\*For evening games, PAF (Profesyonellige Aday Futbolcu) teams of the clubs would often play earlier in the day in the same field. I played against Galatasaray PAF as a member of Genclerbirligi PAF prior to a league game. Sabri was in the game and was playing as an attacking midfielder. \n\n\\*Many stadiums didn't have lighting well into early 2000s, teams had to play day games.\n\n\\*There was no assigned seating in most stadiums (or limited to \"numarali tribun\")\n\n\\*Kidnapping players to sign them was common (i.e. you'd get to the player first, make him sign a pre-contract and stash him away in a hotel somewhere so nobody else gets to him while you're negotiating with his team). There was also the \"hülle\" method of signing a guy -which involved having them fake sign with a Bulgarian team or something to get around paying compensation to his old team.\n\n\\*National team was so bad. So bad. An embarrassment. Up until qualifying for Euro 96, people would still recount beating the legendary Hungarian team in a friendly as the team's greatest success.",
        "subreddit": "superlig",
        "author": "Known-Fondant-9373",
        "score": 87,
        "date": "2024-08-19 21:46:25"
    },
    {
        "title": "Standing and Results - Week 2",
        "body": "",
        "subreddit": "superlig",
        "author": "Biltema",
        "score": 20,
        "date": "2024-08-19 21:22:26"
    },
    {
        "title": "Galatasaray was the club with the most cancelled goals of the 23/24 season",
        "body": "This thread will surely not be controversial",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 150,
        "date": "2024-08-19 14:44:35"
    },
    {
        "title": "What's wrong with Serhat Akın dude?",
        "body": "Although I am a Galatasaray fan, I like him. I remember him playing for Fenerbahçe. I respected him a lot because he was ambitious. But as I was watching his stream at Sport Digitale last night I realized he kept shitting on Galatasaray. He accused rival teams of not playing well enough against Galatasaray. He said they play their best against Fenerbahçe. I gotta admit I find his crying hilarious. But last night he was way out of line. I'm afraid he's spreading too much toxicity among young Fenerbahçe fans. Is Galatasaray the reason for Fenerbahçe's draw? Why is he seeking excuses outside? ",
        "subreddit": "superlig",
        "author": "dei_himself",
        "score": 26,
        "date": "2024-08-18 09:20:10"
    },
    {
        "title": "Help - Passo Lig for foreigner ",
        "body": "Hello I have created my Passo account but unable to create a Passo lig. I’m hoping to go to a Galatasaray game at the end of October and having issues with the website/app. \nWhen I try create it keeps kicking me out and won’t accept a Canadian cell number.\n\nAnyone know how to get around this or is it possible to get this sorted at the stadium 2-3 days before the match? \n\nI still haven’t bought tickets yet \n",
        "subreddit": "superlig",
        "author": "Zestyclose-Two-237",
        "score": 2,
        "date": "2024-08-17 23:28:46"
    },
    {
        "title": "How to Add the Galatasaray Badge Next to My Name on Reddit?",
        "body": "How can I add the Galatasaray badge next to my name on Reddit? I'm new here and have seen some users with team badges. Is there a specific process I need to follow to display the Galatasaray emblem next to my username? Any help would be appreciated!",
        "subreddit": "superlig",
        "author": "Outrageous-Tooth9843",
        "score": 4,
        "date": "2024-08-17 23:18:16"
    },
    {
        "title": "Started to feel like this subreddit is no different than X.",
        "body": "There have been matches of the week since yesterday. There is not a single sports related thing. Everyone is trying to make their team a champion. As if what is written here works? dsadsadsa\n\nI also know certain account names. I am saying this for Fenerbahçe, Trabzon, Galatasaray and Beşiktaş. These accounts make obvious \"annoying\" troll posts and to be frank, no action is taken for them.\n\nThe vision is \"hahaha Ali Koç fell down\", \"hahaha Dursun Özbek does not know how to speak\" and it does not go beyond that. Also, everything is repetitive. No one is making a creative, well-informed post. And I guess the mods are not really involved in this. Or rather, there are so many comments like this that they cannot stop. Maybe I should respect people's comments but I think I am nostalgic for the old days. As you know, Reddit is very popular in Turkey now. Yahu bir insanın derdi (bunu kendi takımımın taraftarları için de söylüyorum bu subreddit'te) maç olsun da troll'ük yapıp shit talk yapayım olabilir mi? Bu nasıl vakit? Bazen bu boş vakitlere özeniyorum, o kadar insanların boş vakti var ya :D\n\nI think I will leave this subreddit. (I know you don't care, calm down haha)  \nBecause it's no different from Twitter/X. I miss old good lovely respectful days. Tabii ki Reddit popülerleşti ve varyasyon arttı. Bunun farkındayım, bu diğer Türk subreddit'lerine de vurdu.  \nFakat malum Türkiye'de futbol kutsal, burada ekstra bir \"eğlence\" var. \n\nSanırım Serkan Akkoyun gibi hayal ediyorken r/superlig 'i, Serdar Ali Çeliker yaşıyorum.   \nBu kadar önemsemeyin arkadaşlar, öncesi sonrası haftalık 2 saatlik bir eğlence. \n\nHerkese iyi günler. ♥",
        "subreddit": "superlig",
        "author": "KemyTheWizard",
        "score": 20,
        "date": "2024-08-17 22:37:03"
    },
    {
        "title": "Longest unbeaten run in Süper Lig history",
        "body": "",
        "subreddit": "superlig",
        "author": "cuntsmen",
        "score": 78,
        "date": "2024-08-17 18:18:32"
    },
    {
        "title": "TFF postponed matchweek 3 for Beşiktaş, Galatasaray, Trabzonspor, and Başaksehir because of European Qualifiers",
        "body": "",
        "subreddit": "superlig",
        "author": "benimolmcan",
        "score": 14,
        "date": "2024-08-16 15:08:19"
    },
    {
        "title": "Turkish teams next European opponents",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 175,
        "date": "2024-08-16 10:43:11"
    },
    {
        "title": "Standpoint of Turkish teams in Europe as of August 15th",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 32,
        "date": "2024-08-15 19:38:22"
    },
    {
        "title": "Distance covered in the first matchweek of Süper Lig",
        "body": "",
        "subreddit": "superlig",
        "author": "Jemal2200",
        "score": 20,
        "date": "2024-08-15 16:54:47"
    },
    {
        "title": "The cheapest ticket behind the goal for Konya - GS is more expensive than a full season ticket behind the goal",
        "body": "First picture is the kombine prices, second picture the prices for the Galatasaray game. And then people ask why the stadiums aren't full, how much sense does this pricing make?! My parents wanted to go to the game so I told them to buy a kombine instead and that we may as well transfer the tickets to students when they can't attend. Pure stupidity and I wouldn't be surprised if it's the same for many other clubs. ",
        "subreddit": "superlig",
        "author": "AvrupaFatihi",
        "score": 23,
        "date": "2024-08-15 13:47:10"
    },
    {
        "title": "Week 1: Best 11",
        "body": "Do you agree?",
        "subreddit": "superlig",
        "author": "ay_gs1905",
        "score": 19,
        "date": "2024-08-13 12:20:20"
    },
    {
        "title": "Süper Lig 2015/2016 Top Goalscorers \n",
        "body": "",
        "subreddit": "superlig",
        "author": "MobileTheft",
        "score": 112,
        "date": "2024-08-13 11:41:41"
    },
    {
        "title": "Süper Lig standings after week 1",
        "body": "",
        "subreddit": "superlig",
        "author": "cuntsmen",
        "score": 70,
        "date": "2024-08-12 20:09:25"
    },
    {
        "title": "International media, when they try to pronounce Turkish club names.",
        "body": "",
        "subreddit": "superlig",
        "author": "Asendra01",
        "score": 399,
        "date": "2024-08-10 11:08:45"
    },
    {
        "title": "Galatasaray win the first game of the 2024-2025 Süper Lig season against Hatayspor",
        "body": "",
        "subreddit": "superlig",
        "author": "BeautifulAlert5740",
        "score": 51,
        "date": "2024-08-09 20:08:08"
    },
    {
        "title": "Match Discussions: Süper Lig - Week 1",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 18,
        "date": "2024-08-09 18:18:44"
    },
    {
        "title": "The top 10 longest win streaks in süper lig history",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 101,
        "date": "2024-08-08 09:03:14"
    },
    {
        "title": "Prediction thread for the 24/25 season.",
        "body": "As the league is about to start in two days with Galatasaray - Hatayspor, it’s the perfect time for a prediction thread.\n\nSo copy and answer the questions:\n\nChampion:\n\nSecond place:\n\nGol krali:\n\nAssist leader:\n\nDisappointment of the year club and player:\n\nRevelation of the year club and player:\n\nWinner Turkish Cup:\n\nBonus question.\n\nWill there be a red card during Fenerbahce - Galatasaray and Trabzonspor - Fenerbahce?\n\nWill Okan Buruk, Abdullah Avci, Jose Mourinho or Giovanni van Bronckhorst survive until the end of the season?",
        "subreddit": "superlig",
        "author": "JCBDoesGaming",
        "score": 15,
        "date": "2024-08-07 12:20:29"
    },
    {
        "title": "Passolig bell",
        "body": "Hi there,\n\nBeen in Turkiye 3 weeks now and still can’t get Passo to work. Tried Turkish sims, different accounts the works. \n\nIs there an office I can go and speak to someone directly, haven’t been able to find someone that speaks to english even on the phones yet. \n\nDesperate to see a match (preferably the Galatasaray game) before I fly out Sunday ",
        "subreddit": "superlig",
        "author": "lebrowndj",
        "score": 2,
        "date": "2024-08-07 09:53:49"
    },
    {
        "title": "Galatasaray still haven’t paid €2,5m of the €4m to Hannover for Derrick Köhn",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 26,
        "date": "2024-08-07 09:18:38"
    },
    {
        "title": "Passo Card with a Different Team",
        "body": "Hi everyone! \n\nI'm a foreigner visiting from the United States. I knew I was going to go to the Fenerbahçe match on Saturday, so I set up my card with them and it has the Fenerbahçe crest on the back. \n\nI was setting up my account today on the Passo app so I can purchase my tickets when they go on sale and not miss out (on Friday for general sales) and noticed there are still seats available for the Galatasaray match the day before. I'd love to go to both matches if possible.\n\nThe tickets available are away supporters (Misafir) which I wouldn't do and some of the more expensive tickets starting in Category 5 (2,200 lira). The Category 5 tickets are on the sidelines in the 400 sections. \n\nAm I allowed to purchase tickets to this match in that category even though my Passolig card shows Fenerbahçe on the back? \n\nI didn't see any guidance on this anywhere, so figured I would ask. I could see it being an issue if you bought in the main supporters end or the away supporters, but I don't know about the rest of the stadium. \n\nThanks in advance!",
        "subreddit": "superlig",
        "author": "Noodles357",
        "score": 2,
        "date": "2024-08-06 17:17:59"
    },
    {
        "title": "Galatasaray to play Young Boys in the Champions League Play-off",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 103,
        "date": "2024-08-05 11:03:34"
    },
    {
        "title": "Rivalries",
        "body": "Why do Trabzonspor fans hate Fenerbahce more than Galatasaray? Although Galatasaray is more successful with 24 titles and Fenerbahce with 19. Is the Trabzonspor-Besiktas rivalry tense, or more respectful? \n\n\n\nDo Fenerbahce fans consider the rivalry with Besiktas or Trabzonspor more important?",
        "subreddit": "superlig",
        "author": "VeterinarianLate4880",
        "score": 7,
        "date": "2024-08-04 20:42:10"
    },
    {
        "title": "Galatasaray sign Sara with a transfer fee of €18M that will be paid to the player's former club in 9 equal installments spread over 3 seasons.  Contract for 5 seasons, and a salary of €2.75M.",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 39,
        "date": "2024-08-04 20:16:46"
    },
    {
        "title": "Galatasaray Build Up and Besiktas Defensive Structure",
        "body": "",
        "subreddit": "superlig",
        "author": "Objective_Minds",
        "score": 27,
        "date": "2024-08-04 12:31:57"
    },
    {
        "title": "[OC] Besiktas Defensive Shape And Galatasaray's Struggles",
        "body": "",
        "subreddit": "superlig",
        "author": "Objective_Minds",
        "score": 47,
        "date": "2024-08-04 00:00:48"
    },
    {
        "title": "Galatasaray 0 - [5] Besiktas - Mustafa Erhan Hekimoğlu 90+3' | Turkish Super Cup",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 20,
        "date": "2024-08-03 19:55:13"
    },
    {
        "title": "Galatasaray 0 -5 Besiktas | Post Match Thread",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 128,
        "date": "2024-08-03 19:45:12"
    },
    {
        "title": "Match Thread | Galatasaray - Besiktas | Süper Kupa 2024",
        "body": "First match of the season lads",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 22,
        "date": "2024-08-03 17:30:13"
    },
    {
        "title": "Besiktas starting XI vs Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 8,
        "date": "2024-08-03 16:58:50"
    },
    {
        "title": "Transfer income and expenditures per club in the last ten seasons in our league",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 45,
        "date": "2024-07-31 09:19:58"
    },
    {
        "title": "Galatasaray and KVC Westerlo agree on deal for Emin Bayram",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 8,
        "date": "2024-07-30 18:52:51"
    },
    {
        "title": "[OFFICIAL] Galatasaray has signed Elias Jelert for 9M euros and on a 5 year contract",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 20,
        "date": "2024-07-25 18:58:14"
    },
    {
        "title": "For how much do you think Barış Alper  will be transferred?",
        "body": "There are rumors of a transfer above 30 million, but I don't think these sources are reliable. Not because he is a Galatasaray player; similar sources claimed 30 million was offered for Semih, but I also don't find that realistic at all. What I'm asking is, how much do you think BAY is worth, and for how much do you think he will be transferred (considering any Turkish player will get transferred for less than their actual value)?\n\nIn my opinion, he is a great player and was one of the key players in Euro 2024. He has strength, is fast, has an amazing work rate both offensively and defensively, can carry the ball, and doesn't lose it easily. However, I find his passing and crossing mediocre, and his shooting isn't the best either. Additionally, his technical ability and game sense/IQ seem to be lacking. Now, don't get me wrong, what I mean by 'lacking' is lacking for a 35 million player. Overall, I still think he is a great player and hope he becomes a top player in Europe.\n\nBack to the topic, I think he will get transferred for 20-30 million, and anything over 35 million seems unrealistic to me. What do you (especially Galatasaray fans) think?",
        "subreddit": "superlig",
        "author": "FrikFrik_",
        "score": 8,
        "date": "2024-07-23 22:01:13"
    },
    {
        "title": "Barış Alper Yılmaz and Ferdi Kadıoğlu now have the biggest market values at their respective clubs",
        "body": "(Transfermarkt)",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 192,
        "date": "2024-07-19 06:36:09"
    },
    {
        "title": "fenerbahçe kulübü, objektif olarak bakıldığında, 5 yıldız konusunda gerçekten haklı mı?",
        "body": "merhabalar,\n\nen son sanırım 2011-14 yılları arasında adam akıllı takip ettim süperlig'i. o zamanlarda fenerbahçe 3 yıldızlı armasını kullanıyordu. biraz yazılan, konuşulanlara baktığımda, tff'nin 1923-59 arası organize ettiği liglerdeki şampiyonluklar da dahil edildiğinde, fenerbahçe 5 yıldızlı bir kulüp oluyormuş. yine aynı zaman arasında beşiktaş'ın ve birkaç anadolu kulübünün de şampiyonlukları varmış.\n\ntaraftarı olduğunuz kulübü bir kenara bakıp, objektif bir perspektiften yanıtlamanızı istiyorum; fenerbahçe bu konuda gerçekten haklı mı?\n\ntwitter / x.com'da gördüğüm gönderilerde galatasaray ve beşiktaş taraftarı, fenerbahçe'lilerle dalga geçmekte bu 5 yıldız muhabbetinden dolayı.\n\nyapıcı şekilde yanıtlayıp yorumlarda birbirinizi yemezseniz sevinirim.\n\nteşekkürler.\n\n[fenerbahçe 5 yıldızlı arma](https://i.imgur.com/JlBVjwO.jpeg)",
        "subreddit": "superlig",
        "author": "tarkology",
        "score": 13,
        "date": "2024-07-15 16:13:57"
    },
    {
        "title": "Hannover 96 President Martin Kind: „Galatasaray did not pay the transfer fee for Derrick Köhn. The money did not arrive in our bank account. So we took legal action.“",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 84,
        "date": "2024-07-13 09:41:28"
    },
    {
        "title": "Fenerbahçe, Galatasaray, Beşiktaş ve Trabzonspor; TFF Başkan Adayı Mehmet Büyükekşi'nin adaylığı için imza vermedi.",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 41,
        "date": "2024-07-12 14:55:22"
    },
    {
        "title": "The UEFA club rankings have been updated",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 160,
        "date": "2024-07-12 12:53:04"
    },
    {
        "title": "Galatasaray has been fined 2.5 Million Euro from FIFA for the unlawful signing of Tetê",
        "body": "",
        "subreddit": "superlig",
        "author": "AspergerKid",
        "score": 53,
        "date": "2024-07-11 16:19:42"
    },
    {
        "title": "Guys ngl im kinda confused after this victory ",
        "body": "As someone of kurdish origin who speaks and was raised turkish and has supported the National team and Galatasaray all my life I feel kinda conflicted right now.\n\nI was screaming and celebrating like crazy yesterday. But after Merih made that bozkurt Sign after the victory I kinda feel confused. Its always the same thing when things get too political in sports (also after the soldier salutes after the france game)\n\nI know one side says the sign represents the turkish people and was used way before it got any political meaning. The other side says its a clear MHP and fascist sign. Maybe the truth is somewhere in the middle.\n\nIs anyone feeling similar. ",
        "subreddit": "superlig",
        "author": "Abilando",
        "score": 0,
        "date": "2024-07-03 10:53:31"
    },
    {
        "title": "Batshuayi to Galatasaray, now official after he signed a 3-year contract",
        "body": "",
        "subreddit": "superlig",
        "author": "sabr-bg",
        "score": 55,
        "date": "2024-07-01 16:11:22"
    },
    {
        "title": "From Wojak Meme Generator",
        "body": "",
        "subreddit": "superlig",
        "author": "Certain_Strike_38",
        "score": 34,
        "date": "2024-06-25 08:04:45"
    },
    {
        "title": "I don’t understand the lobbying thing",
        "body": "So apparently (according to some) Montella is just a puppet, teams like Galatasaray are lobbying so their players get more play time, characters like Hamit and other TFF figures are pulling the strings but… who is profiting from this? Why do they do this? Why would Galatasaray want that their crap players play and embarrass their club and national team? Why would Hamit and other TFF figures intentionally destroy the national team?",
        "subreddit": "superlig",
        "author": "Flashy-Swimming4107",
        "score": 0,
        "date": "2024-06-22 19:59:58"
    },
    {
        "title": "Fenerbahçe kongre üyeleri, Galatasaray'ın şampiyonluk kutlaması yaptığı 'Galatasaray Spor Kulübü Kalamış Tesisleri'ne saldırdı!",
        "body": "",
        "subreddit": "superlig",
        "author": "Inefraspa",
        "score": 24,
        "date": "2024-05-29 21:47:47"
    },
    {
        "title": "Süper Lig Teams &amp; Their Starting Qualifying Rounds for Next Season’s European Tournaments ",
        "body": "Hoping for all teams to qualify for the group stage of their respective tournaments. \n\nWould be really cool to see both Galatasaray and Fenerbahce qualify for the UCL *(though I’m already dreading the comparison and the “your team lost and we didn’t, we carry the coefficient pts” bullshit talk…)* \n\nBasaksehir under Cagdas have been great. Honestly, it went under the radar, but what he did with them, taking them from dead last with 0 pts and no goals scored after 3-4 weeks, to finishing top 4 is a great achievement. Hopefully he takes European matches seriously. \n\nI’m expecting Besiktas to be reinvigorated and compete for a championship next year and hopefully that transfers over to European success. \n\nWith Trabzon, Avci needs to actually care about Europe and hopefully they can have meaningful contribution to coefficient pts. \n\nObviously, *if* the teams can’t qualify for their respective tournaments, next best option is for them to qualify for the group stage of the lower  tournament. ",
        "subreddit": "superlig",
        "author": "gorgonizedbyurTITS",
        "score": 104,
        "date": "2024-05-28 13:36:21"
    },
    {
        "title": "Attendance figures for Süper Lig for the 2023-24 season",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 79,
        "date": "2024-05-28 08:52:15"
    },
    {
        "title": " A comparison of points collected by top 5 Süper Lig teams and how many times they are crowned champions in last 10 years.",
        "body": "",
        "subreddit": "superlig",
        "author": "bavban",
        "score": 68,
        "date": "2024-05-26 19:59:40"
    },
    {
        "title": "UCL 2024/2025 projected pots",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 29,
        "date": "2024-05-26 18:32:34"
    },
    {
        "title": "Galatasaray are champions of 2023/24 season!",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 182,
        "date": "2024-05-26 18:02:29"
    },
    {
        "title": "Galatasaray win 3-1 against Konyaspor. Cimbom Sampiyon.",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 58,
        "date": "2024-05-26 18:02:20"
    },
    {
        "title": "Galatasaray on Instagram: \"Hakemin ve VAR'ın penaltı vermediği pozisyonda Barış’ın bileği bu hale geldi❗️\"",
        "body": "",
        "subreddit": "superlig",
        "author": "BarbaraPalv1n",
        "score": 10,
        "date": "2024-05-26 17:10:29"
    },
    {
        "title": "Some Konya “fans” attacked a car that had Galatasaray fans inside",
        "body": "",
        "subreddit": "superlig",
        "author": "sag0pak",
        "score": 19,
        "date": "2024-05-26 14:55:02"
    },
    {
        "title": "Dursun Özbek won the Galatasaray presidential election.",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 15,
        "date": "2024-05-25 16:13:56"
    },
    {
        "title": "Galatasaray reports Fener to PDFK due to locker room chants",
        "body": "",
        "subreddit": "superlig",
        "author": "evetttt",
        "score": 23,
        "date": "2024-05-24 17:39:55"
    },
    {
        "title": "Türkiye NT preliminary squad for Euro 2024",
        "body": "",
        "subreddit": "superlig",
        "author": "Jemal2200",
        "score": 51,
        "date": "2024-05-24 17:28:27"
    },
    {
        "title": "With today's Turkish Cup win, Beşiktaş overtakes Fener as the second most decorated soccer team in Turkey",
        "body": "",
        "subreddit": "superlig",
        "author": "evetttt",
        "score": 146,
        "date": "2024-05-23 20:22:41"
    },
    {
        "title": "After the promotion to Premier League, Leicester will not pick up Yunus Akgün's option, he is returning to Galatasaray.",
        "body": "",
        "subreddit": "superlig",
        "author": "chinli",
        "score": 28,
        "date": "2024-05-21 09:58:34"
    },
    {
        "title": "Ali Koç attacked Selahattin Baki last night after the Galatasaray - Fenerbahçe Derby.",
        "body": "",
        "subreddit": "superlig",
        "author": "Swimming-Purchase-88",
        "score": 21,
        "date": "2024-05-20 05:59:50"
    },
    {
        "title": "Fener's away stand having a blast despite galatasaray's attempt to silence them with loud music",
        "body": "",
        "subreddit": "superlig",
        "author": "Little-Delay-2616",
        "score": 132,
        "date": "2024-05-19 23:57:46"
    },
    {
        "title": "İsmail Kartal's son, Emre Kartal, repeatedly punched the stadium manager of Galatasaray, Ali Çelikkıran after the game.",
        "body": "",
        "subreddit": "superlig",
        "author": "Swimming-Purchase-88",
        "score": 49,
        "date": "2024-05-19 20:54:41"
    },
    {
        "title": "Fenerbahçe beats galatasaray 1-0.",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 243,
        "date": "2024-05-19 18:08:02"
    },
    {
        "title": "Alexander Djiku (Fenerbahçe) second yellow card vs Galatasaray 21'",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 35,
        "date": "2024-05-19 16:54:35"
    },
    {
        "title": "[Match Thread] Fenerbahce - Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "manmadegod-",
        "score": 4,
        "date": "2024-05-19 16:07:09"
    },
    {
        "title": "The Relegation Battle",
        "body": "One thing that has gone under the radar this season in the Süper Lig is the relegation battle. Perhaps due to the fact there is such a big gap in quality between the top two and the rest of the league, it has meant that the other 18 clubs have managed to beat and lose to each other in equal measure throughout the season.\n\nWith four relegation spots, just İstanbulspor have confirmed their relegation so far, and we could see a scenario where the other relegation spots are filled with teams ending the season on more than 40 points.\n\nThe following matches will be of interest today, all kicking-off at 7pm local time:\n\n*Samsunspor - Alanyaspor*\nSamsun look pretty safe on 42 points. Their opponents, Alanyaspor, are currently upper mid-table and have a very slim chance of making a 5th-place finish, which will offer Europe should Trabzonspor win the cup. A win tonight will secure Samsun’s safety, a draw won’t leave them feeling particularly comfortable, given their final game is Karagümrük away, and should the two sides go level on points into that match, a win by two goals would see FKG rise above Samsun.\n\n*Kayserispor - Konyaspor*\nHad Kayseri not been deducted 3 points earlier in the season by the TFF, then they would already be safe. They instead have 41 points, just four more than FKG and Hatay, who occupy the top two spots in the relegation zone. A win today would see Kayserispor safe, but standing in their way is Konyaspor, just a position and a point below them in the table. \n\nFor Konya, beating Kayserispor today will be all the more important given their final game of the season is Galatasaray away. Galatasaray host Fenerbahçe on Sunday night, and should the away side win, Galatasaray must not lose to Konya at home to secure the title. Therefore, Konya will know they need to get the job done themselves tonight and will watch the derby tomorrow to see what kind of Galatasaray they will face in the final game of the season. \n\n*Ankaragücü - Pendikspor*\nAnother 6-pointer sees the capital club take on the Pendik, a team battling their way through their first-ever Süper Lig season. Ankaragücü haven’t won in over a month, and with their final game of the season being Trabzon away, they will be aware of the necessity to get points on the board tonight.\n\nFor Pendik, things hang finely in the balance. After their trip to the capital, they face Gaziantep at home, which could end up as a relegation play-off depending on results elsewhere.\n\n*Gaziantep - Fatih Karagümrük*\nThese two teams sit either side of the thin red line which decides between another season in the Süper Lig or a return to the 1 Lig. Given the closeness of the teams at the bottom and the fixtures next weekend, it looks unlikely that these two will end the season still sitting next to one another. Antep will be high on confidence after they smashed Adana Demirspor 6-1 away from home last weekend.\n\n*Beşiktaş - Hatayspor*\nHatay became the latest team to swap managers at the start of the month, when they parted ways with Volkan Demirel, the former Fenerbahçe legend who had overseen them through one of the toughest times in their Süper Lig history. A trip to 5th-placed Beşiktaş would, in any other season, be uneasily anticipated, but given BJK’s topsy-turvy season, Hatay might rightly believe the points are their for the taking. \n\n\n",
        "subreddit": "superlig",
        "author": "aral_sea",
        "score": 30,
        "date": "2024-05-18 06:02:08"
    },
    {
        "title": "Fatih Karagümrük 2-3 Galatasaray ",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 35,
        "date": "2024-05-12 18:01:54"
    },
    {
        "title": "Passolig hakkında",
        "body": "Arkadaşlar PassoLig kalkmıyor muydu ? Galatasaray kombineleri neden tekrardan PassoLig üzerinden satışa sunuldu? Ayrıyeten PassoLig Beşiktaş ile 5 yıllık \"özel??\" bir anlaşma yapmıș sanırım sizce bu nasıl olucak Beşiktaş'a özel bir app mi çıkartılacak?",
        "subreddit": "superlig",
        "author": "Tiny_Pomegranate4765",
        "score": 1,
        "date": "2024-05-11 07:22:54"
    },
    {
        "title": "Galatasaray with the opportunity to celebrate the super cup and league title at home May 19",
        "body": "",
        "subreddit": "superlig",
        "author": "H_Mus",
        "score": 15,
        "date": "2024-05-06 19:07:21"
    },
    {
        "title": "Galatasaray 6-1 EMS Yapı Sivasspor",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 90,
        "date": "2024-05-05 17:55:18"
    },
    {
        "title": "Tourist question about ticket availability for Galatasaray vs sivasspor",
        "body": "Hi there, I’m in Istanbul for a week and love football. I really want to attend the galatasaray vs sivasspor matcg tomorrow and understand I require a passolig card which I can add to the app to buy tickets and attend. I can’t find information about ticket availability however. How do I know if the game is sold out or if only expensive seats are left? I don’t want to buy the passolig card and find out I can’t attend due to no seats or expensive seats. \n\nAlternatively I’ve read it’s sometimes easier to get the away teams passolig card and buy tickets in the away end. Is it likely this will be sold out? Is there any way to check either of these things.\n\nIdeally I’d like to sit in the home end, but I’m willing to sit in the away stand and enjoy the atmosphere! Any help is much appreciated.",
        "subreddit": "superlig",
        "author": "FlimsyMulberry7743",
        "score": 2,
        "date": "2024-05-04 15:45:26"
    },
    {
        "title": "Projected pots if Fenerbahce and Galatasaray make it to the UCL stages",
        "body": "",
        "subreddit": "superlig",
        "author": "ekinjamalGFB",
        "score": 51,
        "date": "2024-05-02 15:11:50"
    },
    {
        "title": "Help with Besiktas ticketing?",
        "body": "Hey everyone. I’m coming over to Turkey on May 19th and wanted to come watch Besiktas, online i’m seeing 2 different games on these dates? Do you play Hatayspor or Kasimpasa on May 19th? I have no idea why the internet is showing 2 different games for this date?",
        "subreddit": "superlig",
        "author": "jetlaggedtof_ck",
        "score": 5,
        "date": "2024-04-29 16:34:57"
    },
    {
        "title": "Galatasaray Defeat Adana Demirspor 3-0",
        "body": "",
        "subreddit": "superlig",
        "author": "g444vgja",
        "score": 71,
        "date": "2024-04-26 19:23:39"
    },
    {
        "title": "Galatasaray Penalty Shout vs Adana",
        "body": "",
        "subreddit": "superlig",
        "author": "evetttt",
        "score": 0,
        "date": "2024-04-26 18:45:59"
    },
    {
        "title": "There is now a 4 point gap between Galatasaray and Fenerbahçe.",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 95,
        "date": "2024-04-22 19:19:19"
    },
    {
        "title": "Referee ends the first half on a 3v3 Galatasaray counter attack",
        "body": "",
        "subreddit": "superlig",
        "author": "alozz",
        "score": 0,
        "date": "2024-04-21 20:59:33"
    },
    {
        "title": "Galatasaray beat Pendikspor 4-1.",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 68,
        "date": "2024-04-21 17:58:38"
    },
    {
        "title": "What’s funny is that one of the clubs on the top will have more trophies at the end of the season than one of the top 2 teams in the league that are 33/35 points ahead of 3rd place. Either Galatasaray’s or Fenerbahçe’s season will end in a catastrophe",
        "body": "",
        "subreddit": "superlig",
        "author": "_conqueror",
        "score": 35,
        "date": "2024-04-20 16:01:33"
    },
    {
        "title": "Süper Lig Overview of European Points over the Past 5 Seasons",
        "body": "Given that all Turkish teams have now been eliminated and we have secured the 9th league spot moving into next year, I figured it was time review how teams have contributed to the league coefficient over the past 5 seasons (2019/20 to 2023/24):\n\n* Fenerbahçe stand comfortably first in terms of contribution per season: participated in 3/5 past seasons, points accumulated are 48. **Roughly 16 points per season participated.**\n* Galatasaray stand second in terms of contribution per season: participated in 4/5 past seasons, points accumulated are 43. **Roughly 10.75 points per season participated.**\n* Başakşehir are 3rd: participated in 4/5 last seasons, points accumulated are 34. **Roughly 8.5 points per season participated.**\n\nNow, for a big drop-off and, in my opinion, some of the teams that have disappointed overall.\n\n* Sivasspor are 4th: participated in 3/5 last seasons, points accumulated are 17. **Roughly 5.67 points per season participated.**\n* Trabzonspor are 5th: participated in 3/5 last seasons, points accumulated are 13. **Roughly 4.33 points per season participated.**\n* Beşiktaş are 6th: participated in 4/5 last seasons, points accumulated are 16.5. **Roughly 4.125 points per season participated.**\n* Adana Demirspor are 7th: participated in 1/5 last seasons, points accumulated are 3.5. **Roughly 3.5 points per season participated.**\n* Konyaspor and Malatyaspor are tied 8th: both participated in 1/5 last seasons, points accumulated are 2.5. **Roughly 2.5 points per season participated.**\n* Alanyaspor are 10th: participated in 1/5 last seasons, points accumulated are 0.5. **Roughly 0.5 points per season participated.**\n\nGS and FB have been carrying the coefficient the last 5 years, that's a fact. Başakşehir has also contributed, nothing too special but still pretty good in comparison to other clubs.\n\nThe biggest disappointments to be are Trabzonspor and Beşiktaş. To have less points per season than Sivasspor, who have been working with an insanely thin squad every European season, is shameful if I'm honest. The others have also been underperforming however they have lower expectations and have faced tough opponents in qualifier knockouts. Alanyaspor's loss to Rosenborg (1-0 away), Malatyaspor's loss to Partizan and Adana Demirspor's loss to Genk (penalties) are commendable. Konyaspor's disappointment vs Vaduz is inexcusable though, that is a horrible stain on our coefficient.\n\nMy point is, if we want this league to actually perform and keep improving, then we need to face the realities and everyone needs to pull their weight regarding the coefficient. I will say I also personally place blame on one manager who has consistently underperformed as well, Abdullah Avcı. I have never been comfortable knowing he's on the bench for a European game, he underperformed while managing Başakşehir and kept that up through managing Beşiktaş and Trabzonspor. If Trabzonspor finish 3rd, they should look into the option of having 2 managers and rotate between them in Europe and the league^(/s but not really).\n\nHere's to hoping for another relatively successful season in Europe, and it will be a fun watch seeing how the final few weeks play out (competition for the 4th and 5th spot is looking very interesting).\n\n&amp;#x200B;\n\nTLDR: Graph basically shows everything according to points per season\n\nhttps://preview.redd.it/ry9f46okwbvc1.jpg?width=1000&amp;format=pjpg&amp;auto=webp&amp;s=37bf187b52bb62cc85b984ac5dc217449b710f2c\n\n**All data from** [here](https://www.football-coefficient.eu/country/10-tuerkiye/). ",
        "subreddit": "superlig",
        "author": "IsThatAWeed_",
        "score": 13,
        "date": "2024-04-19 06:47:58"
    },
    {
        "title": "Galatasaray beat Alanyaspor 4-0",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 63,
        "date": "2024-04-15 18:55:25"
    },
    {
        "title": "Alanyaspor vs Galatasaray 1st half (Cancelled goal, Potential Handball, Kohn Tackle)",
        "body": "",
        "subreddit": "superlig",
        "author": "Turkmandingo",
        "score": 0,
        "date": "2024-04-15 18:14:24"
    },
    {
        "title": "I hope Basak-city dominate the league for few years in a row, because that seems like the only way to save big teams and fans from delusions",
        "body": "Yesterday, another european game, another team that as MUCH LESS squad individual quality, and even a Greek team that is as badly managed as our teams, yet another defeat.\n\nIt is ridicilous that almost every day we still hear the words \"not Fenerbahce quality\" \"not Galatasaray quality\" \"not Besiktas quality\" kind of sentences from fans AND media, despite our clubs how achieved \"0\" in last 20 years internationally, that they can not even get in top 50 teams in europe (over 20 year period). The **delusion** of how big our teams are way out of hand. \n\nThe objective reality is, no matter how much you love and worship your team, the big teams of Turkey are big in their amount of fans, and people's love for them, NOT big in their status in international football. It is pure delusion that vast majority of Turkish football fans think having a squad like any Greek, Russian , Swiss or Scottish team is \"not our level\" despite our teams for decades being literally that level.\n\nAnd I think only way to really hammer this to people's brain in Turkey, would be a team like Basak-city, with new City group agreement, dominating the league over and over with squad that individually much less \"fancy\" than big teams.\n\nWe already had a good preview of this in last 5-6 years, that Basaksehir always had half the squad value of Big teams, and always competed with them in league table , often won over (always finishing atleast over 1 of the bigs, despite not being champions).\n\nI think only hope for saving Turkish football, is such club hammering to the mind of people over and over for several years, that you can win leagues without expensive and fancy signing , in a league as low as Turkish league.",
        "subreddit": "superlig",
        "author": "Horkosthegreat",
        "score": 0,
        "date": "2024-04-12 13:14:47"
    },
    {
        "title": "TFF announces foreign VAR referees for critical matches for the rest of the season",
        "body": "As a result of the negotiations of the Turkish Football Federation with UEFA and 5 European federations, foreign Video Assistant Referees (VAR) will be assigned in the critical matches of the week from the 32nd week of the Trendyol Süper Lig until the end of the season.\n\nThe Video Assistant Referee (VAR) request made by the TFF to the football federations of Italy, Spain, Germany, the Netherlands and Portugal, which are among the top leagues of Europe, was accepted by the respective country federations. \n\nIn the matches where the foreign Video Assistant Referee (VAR) will officiate, the language of communication will be Turkish and English. For this reason; AVAR, AVAR 2 and VAR Support, who can communicate in English, will work alongside the Video Assistant Referee (VAR).\n\nThe matches for which foreign Video Assistant Referees (VAR) will be appointed in the 32nd week of the Trendyol Süper Lig are as follows:\n\nMKE Ankaragücü - Gaziantep Futbol Kulübü A.Ş.\n\nVavacars Fatih Karagümrük - Fenerbahçe A.Ş.\n\nCorendon Alanyaspor- Galatasaray A.Ş.",
        "subreddit": "superlig",
        "author": "Jemal2200",
        "score": 21,
        "date": "2024-04-12 08:48:52"
    },
    {
        "title": "The Super Cup game is now confirmed 3-0 for Galatasaray. Fenerbahçe fined 4 million TL. ",
        "body": "https://x.com/demarkesports/status/1778420551381377439?s=46",
        "subreddit": "superlig",
        "author": "ugurcanevci",
        "score": 27,
        "date": "2024-04-11 14:03:48"
    },
    {
        "title": "Fenerbahçe's punishment for abandoning Süper Kupa: 4,000,000 TL (115,000 €)",
        "body": "The game is counted as a 3-0 win for Galatasaray\n\nBecause of their fans GS has to also pay fines of 212,000 TL (6,000 €)\n\n\n\n",
        "subreddit": "superlig",
        "author": "alperpier",
        "score": 55,
        "date": "2024-04-11 14:03:44"
    },
    {
        "title": "Supercup: Galatasaray vs Galatasaray",
        "body": "Best derby match to date. Finally two teams of quality playing some soccer",
        "subreddit": "superlig",
        "author": "H_Mus",
        "score": 58,
        "date": "2024-04-07 18:51:00"
    },
    {
        "title": "Fenerbahce has stepped off the pitch, Galatasaray players are celebrating.",
        "body": "Icardi scored in the first minutes, the game didn’t restart and the players left the pitch.\n\nThe decision is on the TFF about what happens now.",
        "subreddit": "superlig",
        "author": "JCBDoesGaming",
        "score": 59,
        "date": "2024-04-07 18:39:05"
    },
    {
        "title": "Put domestic disputes aside, Turks shouldn’t be hating on Turks  Internationally",
        "body": "https://www.reddit.com/r/galatasaray/s/1RiBk2oohB\n\nReading this thread on the r/Galatasaray is quite disappointing. You let a Greek guy come in and flame you on your own people. This is too much hate toward your own brethren. Who really wouldn’t want a Turkish victory in Athens against the Greeks? Let’s discuss this on neutral ground.",
        "subreddit": "superlig",
        "author": "Turkmandingo",
        "score": 0,
        "date": "2024-04-07 17:58:04"
    },
    {
        "title": "Turkish Süper Lig table after matchday 31",
        "body": "",
        "subreddit": "superlig",
        "author": "TeaTimeMothafucka",
        "score": 16,
        "date": "2024-04-04 23:02:19"
    },
    {
        "title": "Hatayspor cancelled goal vs Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "Turkmandingo",
        "score": 0,
        "date": "2024-04-02 18:57:17"
    },
    {
        "title": "Kulüpler Birliği, 18 kulübün desteğiyle Ali Koç'un başkanlığa devam ettiğini duyurdu. Ali Koç'un başkanlığa devam etmesini istemeyen tek kulüp Galatasaray oldu.",
        "body": "",
        "subreddit": "superlig",
        "author": "wel0g",
        "score": 46,
        "date": "2024-03-31 09:29:18"
    },
    {
        "title": "This season's Süperlig standings without the penalty goals. It's for the 27th week, but the penalties didn't affect the top 2 in the past 3 weeks. Maybe we should stop talking about penalties and focus on football more.",
        "body": "",
        "subreddit": "superlig",
        "author": "fariskeagan",
        "score": 42,
        "date": "2024-03-27 11:44:47"
    },
    {
        "title": "Galatasaray's statement ",
        "body": "",
        "subreddit": "superlig",
        "author": "TeaTimeMothafucka",
        "score": 17,
        "date": "2024-03-26 11:57:42"
    },
    {
        "title": "Turkish Football Clubs - Finances",
        "body": "Hello Turkish football fans.\n\nA few of us are working on a project to bring together the top European football clubs' financial positions (revenue (excluding player sales), wages, net profit (after tax) and cash).  The objective being to compare and contrast and understand those that are at the extremes for financial stability, etc.\n\nWe would like to include as many Super Lig clubs as possible - but at least the clubs that represented Turkey in UEFA this year (Fenerbahçe, Galatasaray, Besiktas, Adana Demirspor).  \n\nFootball Benchmark published a tweet / X recently ([https://twitter.com/Football\\_BM/status/1733029375707136134](https://twitter.com/Football_BM/status/1733029375707136134)) which included some good details for 3 of the 4 (sorry Adana Demirspor!) and also Trabzonspor.  However, it didn't cover all clubs, and didn't include their cash position.\n\nI was hoping that this sub-reddit may be able to help!\n\nDo Turkish clubs have to publish their financial statements to a central government registry? If so, are the results available to the public? Or is there somewhere else I can get the information (e.g. the Austrian federation publishes a summary report with all the clubs' details from Bundesliga 1 and 2).\n\nThank you very much for reading and for any help that you can provide.",
        "subreddit": "superlig",
        "author": "JSS2107",
        "score": 10,
        "date": "2024-03-26 02:55:23"
    },
    {
        "title": "Announcement of new moderators and another request for more users to join our modteam",
        "body": "We made a [post](https://www.reddit.com/r/superlig/comments/1b1f4zw/help_wanted_navigating_the_stormy_seas_of/) about a month ago to ask for help and are now happy to announce our new moderators, u/BeautifulAlert5740 and u/AspergerKid, who joined about a week ago. Here's a short message from the new mods:\n\nu/BeautifulAlert5740\n\n&gt; Hello everyone, I’m excited to be a part of the moderation team. I’ve been active in this community for some years now, and I support Trabzonspor however I have a general interest in all Turkish teams. I also run a YouTube channel that semi-often posts about Turkish football. (Search Kursat)\n\nu/AspergerKid \n\n&gt; Hello fellow futbolseverler!\n\n&gt; I'm happy to be one of the new members of this sub's moderation Team!\nA bit about me, I'm turning 23 on Wednesday, and have been a a Fenerbahçe fan for almost my whole life but started actively watching the Turkish Süper Lig starting from the 21/22 season.\nOther clubs I support are my memleket teams:\nÇorum FK and Sakaryaspor\nI'm also a member of one of the official Fenerbahçe dernekleri in Europe but ironically have so far only seen Galatasaray live in action (blame my location lol, they just happened to play friendlies here)\n\nWe had 5 moderators when we started this subreddit over 5 years ago, today we have over 150k subscribers and just one more moderator compared to when we started. So we would like to once more ask for more users to apply for moderation. Preferably users who are part of the Galatasaray or Beşiktaş communities, or someone who doesn't root for any of the top 4 clubs. If you don't want full responsibility and just want to help with design, bots or removing posts/comments etc. then that's fine too.\n\nWe had locked the controversial posts because we couldn't keep up, but we'll open them again now that the new moderators have joined and spent some days getting used to all the functions.",
        "subreddit": "superlig",
        "author": "Biltema",
        "score": 12,
        "date": "2024-03-25 19:45:27"
    },
    {
        "title": "Fenerbahçe says 'postponement', Galatasaray says 'no postponement'. Since there is no consensus between the parties, the TFF will decide.",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 30,
        "date": "2024-03-22 08:33:11"
    },
    {
        "title": "A Different Take on The Events in Trabzon",
        "body": " As a Fenerbahçe fan I couldn't stop thinking about the events that happened both during and after the game with Trabzonspor. They deeply affected me, so I wanted to create this post to share some of my thoughts and also to hear about yours.\n\nI believe there are two points of view in this situation:\n\n**(1) From the Perspective of a Fenerbahçe Official:**\n\nIn this part, I will analyze the events by asking, \"How would I act if I were an official on the team?\" Before making a judgement on the ideas in this part, I suggest you consider that the sole objective of an official on the team is to win the game and keep the players safe.\n\nFrom the beginning and until the end of the first half, everything was nearly perfect. We were leading the game 2-0. The external attempts to escalate tension were unsuccessful (e.g., throwing objects at Ismail Kartal and the bench), and our players remained as calm as they could.\n\nHowever, it's worth mentioning the actions of Mert Hakan and Irfan Can Egribayat. I believe that their behavior wasn't wrong; the banter they engaged in is definitely a part of the game. BUT, in an environment where fans were just looking for an opportunity to raise the tension, what they did was not in the team's best interest. I think any increase in tension would be bad for the team since it would shift the focus onto us instead of highlighting how poorly Trabzonspor was playing. However, these acts cannot justify or be the reason for what the Trabzonspor fans did.\n\nWith the start of the second half, things began to escalate. Trabzonspor fans started to throw water bottles and who knows what else at the players, especially towards our left wing in a large scale. This position is very important because we were primarily building the game from our left wing. Both our goals came with assists from that area.\n\nAs people began to throw more and more, we were unable to play our game due to external interference. Thus, the game began to shift towards Trabzonspor. I think with the fireworks landing just seconds before we conceded the first goal, it was obvious that the situation had nothing to do with football. At that point, if I were a Fenerbahçe official and saw that the referee had no intention or power to stop the game, I would have taken the team off the pitch. This was one of the main mistakes our team made that day. It was clear that there was no environment suitable for playing football.\n\nMoving to the final whistle and celebrations, again, from a Fenerbahçe official's perspective, I would not have allowed my players to stay one more second in that place. Guys, there were very few police officers there. My first priority is the well-being of my players. Considering the mentality of the people in the stadium, I believe it was very dangerous to celebrate there. And with the events that occurred after fans entered the pitch, I deeply regret allowing the players to celebrate on the pitch. What would have happened to the team if one of our players had been stabbed or worse? It's a miracle that all of our players made it out safely. As Ali Koç mentioned in his speech, healing the traumas experienced by our players is very difficult. I think Osayi was not very happy to have to fend off 10 guys in a row. These players have families and kids. The technical team should not have taken this risk.\n\nI believe these are the main mistakes our team made, when we focus on the club's best interest. The criticisms I've mentioned are not about anyone else; they are about us. By making these criticisms, I am simply focusing on our success in the future.\n\n**(2) From the Perspective of a Football Fan:**\n\nIn this part, I'll be analyzing the events from the perspective of a football fan, not specifically a Fenerbahçe fan. I'll try to be as objective and conscientious as possible.\n\nFirst of all, compared to other stadiums, why are there no police officers there? I really can't understand this. It's so obvious that there have been tensions between these teams for nearly 30 years, especially considering the events that occurred during previous games. A referee was beaten up, many dangerous objects were thrown at Volkan Demirel, many games were left unfinished, and more. Considering these, the security precautions taken at the game make me very angry. I've been to many Fenerbahçe matches in Kadıköy and experienced many instances where I wasn't allowed to bring a single plastic bottle into the stadium. Now, how could the Trabzon fans not be stopped from bringing those objects into the stadium? The inadequacy of security is, I believe, the most crucial aspect of the events because no one should experience a life threat at a football game in Turkey.\n\nFurthermore, every team has the right to celebrate on the field under the terms of football. The players didn't commit a crime by celebrating on the pitch. It is in no way a reason for someone to jump onto the pitch and attack the players. Trabzonspor celebrated, and the Galatasaray team celebrated after winning the cup in Kadıköy. To demonstrate my objectivity, some of you may disagree, but I did not approve of the fans' actions in 2012 either. Some of you may argue that external influences triggered the fans in 2012, which is true, but my point is EVERY team can celebrate anywhere. This is just a game, not a war. I can't understand the hatred people harbor against each other in this context. Sometimes we even show unnecessary aggression towards others. This completely diminishes the joy and pleasure we derive from football.\n\nSo, looking at the big picture, there is no security, no safety for players on both sides, and there is pure chaos. Under these conditions, you cannot judge a player for their actions. Imagine a guy with a weird mask jumping onto the pitch and running at you. None of us can understand the psychology of a football player in that situation. It's meaningless to say 'Players should have done this.' Yes, the image of players beating fans may seem disturbing, but you can't expect people to act logically under those chaotic conditions. I really believe this because what do you think other fans would say if this happened to their team? They'd be making the same arguments, boasting about how their player beat rival fans. So, we shouldn't focus on the players' actions. No one should expect a football player to act logically in pure chaos. People should focus on how things reached this point in the first place. How come there were no police officers to stop fans from throwing so many objects or jumping onto the pitch?\n\nThese are my thoughts on the events. I must also say that I am ultimately proud of my team and how they handled the situation. Not every team would have acted so bravely. I really appreciate the character our team showed. What are your thoughts?",
        "subreddit": "superlig",
        "author": "Diligent-Turnover-40",
        "score": 0,
        "date": "2024-03-20 12:13:12"
    },
    {
        "title": "Dursun Özbek: The decision mechanism for the Super Cup is the TFF. Galatasaray is also following the developments. Galatasaray stands behind any decision for the good and benefit of Turkish football. ",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 10,
        "date": "2024-03-19 09:36:45"
    },
    {
        "title": "Süper lig table after matchweek 30.",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 5,
        "date": "2024-03-17 19:49:33"
    },
    {
        "title": "Kasimpasa vs Galatasaray Penalty, Red, and potentials",
        "body": "",
        "subreddit": "superlig",
        "author": "Turkmandingo",
        "score": 0,
        "date": "2024-03-17 15:14:18"
    },
    {
        "title": "Galatasaray beat Kasimpaşa 4-3.",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 59,
        "date": "2024-03-17 15:01:27"
    },
    {
        "title": "[Yagiz] Galatasaray improved Barış Alper Yılmaz's salary and extended his contract until 2028.",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 28,
        "date": "2024-03-16 15:21:58"
    },
    {
        "title": "Süper Lig's Top Scorer the Past 20 Seasons",
        "body": "&amp;#x200B;\n\n|22-23|21-22|20-21|19-20|18-19|17-18|16-17|15-16|14-15|13-14|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|Enner Valencia (Fenerbahce) - 29 goals|Umut Bozok (Kasimpasa) - 20 goals|Aaron Boupendza (Hatayspor) - 22 goals|Alexander Sorloth (Trabzonspor) - 24 goals|Mbaye Diagne (Kasimpasa/Galatasaray) - 30 goals|Bafetimbi Gomis (Galatasaray) - 29 goals|Vagner Love (Alanyaspor) - 23 goals|Mario Gomez (Besiktas) - 26 goals|Fernandao (Bursaspor) - 22 goals|Aatif Chahechouhe (Sivasspor) - 17 goals|\n\n&amp;#x200B;\n\n|12-13|11-12|10-11|09-08|08-07|07-08|06-07|05-06 |04-05|03-04|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|Burak Yilmaz (Galatasaray) - 24 goals|Burak Yilmaz (Trabzonspor) - 33 goals|Alex (Fenerbahce) - 28 goals|Ariza Makukula (Kayserispor) - 21 goals|Milan Baros (Galatasaray) - 20 goals|Semih Senturk (Fenerbahce) - 17 goals|Alex (Fenerbahce) - 19 goals|Gokhan Gunal (Kayserispor) - 25 goals|Fatih Tekke (Trabzonspor) - 31 goals|Zafer Biryol (Konyaspor) - 25 goals|\n\n&amp;#x200B;",
        "subreddit": "superlig",
        "author": "gorgonizedbyurTITS",
        "score": 20,
        "date": "2024-03-13 16:32:20"
    },
    {
        "title": "Goal Ratio and Goal Difference in Super Lig",
        "body": "I was surfing /r/soccer earlier today and saw this [post](https://old.reddit.com/r/soccer/comments/1bbrwn4/goal_ratio_in_the_top_5_leagues/). I wanted to do something similar for the Super Lig, and add in the goal difference of teams so far this season. For the goal ratio, I am only focusing on teams that have a positive goal difference. \n\n**Please see below for goal ratio of teams who have a positive GD.** \n\n|Team|Goals Scored &amp; Conceded|Ratio|Current League Standing|\n|:-|:-|:-|:-|\n|Galatasaray|64:17|3.8|1|\n|Fenerbahce|76:23|3.3|2|\n|Trabzonspor|49:37|1.3|3|\n|Besiktas|39:34|1.15|4|\n|Basaksehir|37:33|1.12|6|\n|Adana Demirspor|42:38|1.11|10|\n|Antalyaspor|33:32|1.03|8|\n\nSeven out of the 20 teams in the Super Lig have a positive goal difference. Teams that have the same GD will be ranked in accordance to the greater number of goals scored (third tie-breaker) \n\n**Please see below the ranking of teams in relation to their goal difference in the league so far.**\n\n|Team|GD|Goals Scored|Current League Standing|\n|:-|:-|:-|:-|\n|Fenerbahce|53||2 - UCL 2nd Qualifying Round|\n|Galatasaray|47||1 - UCL Play-off Round|\n|Trabzonspor|12||3 - EL 2nd Qualifying Round|\n|Besiktas|5||4 - Conference League 2nd Qualifying Round|\n|Adana Demirspor|4|42|10|\n|Basaksehir|4|37|6|\n|Antalyaspor|1||8|\n|Kasimpasa|\\-1||5|\n|Samsunspor|\\-3||11|\n|Sivasspor|\\-4|35|9|\n|Ankaragucu|\\-4|34|16|\n|Fatih Karagumruk|\\-4|33|18 - Relegation Zone|\n|Alanyaspor|\\-5||12|\n|Kayserispor|\\-6||13|\n|Hatayspor|\\-7||17 - Relegation Zone|\n|Gaziantep|\\-8||15|\n|Konyaspor|\\-11||14|\n|Rizespor|\\-13||7|\n|Pendikspor|\\-28||19 - Relegation Zone|\n|Istanbulspor|\\-32 ||20 - Relegation Zone|\n\nPretty interesting to see Rize with -13 GD, while being top half in the standings. However, most of that is due to their heavy losses against the Istanbul big 3. \n\nGalatasaray and Fenerbahce are truly in a league of their own this year. Hopefully with proper adjustments and reinforcements, both TS &amp; BJK, as well as the other gritty Anadolu teams will increase the competition next season. \n\nWhat do you guys think? Find anything else interesting? ",
        "subreddit": "superlig",
        "author": "gorgonizedbyurTITS",
        "score": 8,
        "date": "2024-03-11 20:02:44"
    },
    {
        "title": "European Qualification",
        "body": "After the most recent results, it has been confirmed that Galatasaray will finish in a Champions League qualification spot and Fenerbahçe will finish at least fourth.",
        "subreddit": "superlig",
        "author": "aral_sea",
        "score": 54,
        "date": "2024-03-11 15:02:12"
    },
    {
        "title": "If I see eyupsor in the super lig next season i will throw hands",
        "body": "As a Galatasaray fan I won’t be able to bear another Istanbul team. The thought of Arda Turan as a manager there too makes it even worse (not his biggest fan). Check the rest of the teams. They are all anadolu. I just hope they get relagated vvvvvvvv quickly. Fuck teams with no history ",
        "subreddit": "superlig",
        "author": "polatcurekli",
        "score": 19,
        "date": "2024-03-09 20:09:01"
    },
    {
        "title": "Kasimpasa vs Galatasaray as a UK tourist",
        "body": "Hi, I’m from the UK and visiting istanbul next week. We’re looking to go to a match while we’re out there.\n\nWe have passoligs that are unassigned to a club and tried to get tickets for Besiktas, but it wouldn’t let us, i assume because it needed a Besiktas passolig to buy.\n\nWill i be able to get Kasimpasa tickets with an unassigned passolig? If not is it possible to change? And when do they go on sale? I cannot find this info anywhere\n\n",
        "subreddit": "superlig",
        "author": "blobbatron123",
        "score": 7,
        "date": "2024-03-09 19:29:37"
    },
    {
        "title": "Galatasaray beat Rizespor 6-2.",
        "body": "",
        "subreddit": "superlig",
        "author": "Legal_Helicopter_707",
        "score": 105,
        "date": "2024-03-08 18:59:14"
    },
    {
        "title": "Help with passolig please?? ",
        "body": "Hi all! I’ve bought tickets to see Galatasaray on Fri 8th March, and have also paid for a passolig card to be delivered to the stadium. \n\nI’m trying to login to the Passomobil app so that I can access my ticket, but after it sends the verification code I never receive it, have tried multiple times, restarting my phone, no luck. Luckily it works fine on the website and the code comes through weirdly. Anyone know how I can fix this? Or is there a way to enter the stadium without using the app?\n\nThank you very much in advance!\n\nHoping to get this sorted hopefully haven’t wasted my money:)",
        "subreddit": "superlig",
        "author": "Obvious-Rub8734",
        "score": 2,
        "date": "2024-03-06 16:10:41"
    },
    {
        "title": "Opta's Team of the Week for the 28th Gameweek",
        "body": "",
        "subreddit": "superlig",
        "author": "mray5",
        "score": 22,
        "date": "2024-03-05 12:18:36"
    },
    {
        "title": "Süper Lig table after matchweek 28 (10 matches left)",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 32,
        "date": "2024-03-04 19:18:05"
    },
    {
        "title": "Feyyaz Ucar:” Hasan Arat asked Metin Özturk to delete this tweet from Galatasaray social media, this is disrespectful against us”. ",
        "body": "",
        "subreddit": "superlig",
        "author": "GaIatasarayli",
        "score": 12,
        "date": "2024-03-03 20:14:54"
    },
    {
        "title": "GS beat BJK away",
        "body": "",
        "subreddit": "superlig",
        "author": "evetttt",
        "score": 99,
        "date": "2024-03-03 18:08:24"
    },
    {
        "title": "If Olimpiu Morutan starts 25 games in the league; a €3M buyout option will be activated and Ankaragücü will own 50% of the player’s contract. If he fails to reach this number of games; he will return to Galatasaray at the end of the season.",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 27,
        "date": "2024-03-02 20:24:27"
    },
    {
        "title": "Top 20 UEFA Clubs by Kit Revenue",
        "body": "",
        "subreddit": "superlig",
        "author": "u8kay",
        "score": 25,
        "date": "2024-03-01 20:25:59"
    },
    {
        "title": "[Besiktas] confirms that Halil Umut Meler is the referee for the match against Galatasaray",
        "body": "",
        "subreddit": "superlig",
        "author": "nutelamitbutter",
        "score": 13,
        "date": "2024-03-01 05:28:25"
    },
    {
        "title": "Fatih Karagümruk defeat Galatasaray to head to the semifinals of the Turkish Cup",
        "body": "",
        "subreddit": "superlig",
        "author": "BeautifulAlert5740",
        "score": 105,
        "date": "2024-02-29 19:44:06"
    },
    {
        "title": "Galatasaray 0-[2] Karagumruk - Ryan Mendes Great Goal",
        "body": "",
        "subreddit": "superlig",
        "author": "JCBDoesGaming",
        "score": 10,
        "date": "2024-02-29 19:38:11"
    }
]