{
    "results": [
        {
            "title": "Set in middle ages or antiquity ",
            "body": "Yesterday I watched Gladiator 2 but couldn't complete it. The story is too boring and the amount of horrible cgi is atrocious. I'm looking for a movie set in the antiquity or medevial era to get over Gladiator 2.\n\nI watched Alexander, the two 300s, Kingdom of Heaven, first Gladiator, The Eagle, The King, Outlaw King, The Last Duel, Robin Hood, The Last Legion, Braveheart, Troy and Centurian. If you can recommend something new of decent quality I will be grateful. ",
            "subreddit": "MovieSuggestions",
            "author": "lemambo_5555",
            "score": 4,
            "date": "2024-12-28 02:15:37"
        },
        {
            "title": "Looking for movies with well directed scenes of large crowds of people. ",
            "body": "Some movies that have what I'm looking for: \n\nKingdom of Heaven   \nGladiator   \nThe Lord of the Rings Trilogy   \nThe Batman (2022)   \n12 Angry Men (not really a large crowd but good enough)   \nHigh and Low   \nDog Day Afternoon \n\nI guess what I'm looking for specifically is scenes with crowds of people with a good amount of movement (not just standing still while the focus is on someone else) and in a well-directed natural looking way, not something like The Dark Knight Rises, for example. ",
            "subreddit": "MovieSuggestions",
            "author": "NoopGhoul",
            "score": 18,
            "date": "2024-12-26 12:06:51"
        },
        {
            "title": "I'm looking for some kind of WAR MOVIE ie. Inglorious Bastards, Triple Six Eight, 300",
            "body": "Recently, I learned I really enjoy war movies... WWII and ancient Rome Rome movies... I love the action scenes, war culture, dialogue, and old banter.. It's not specifically WWII and Rome that I'm obsessed about but it just happens that a lot of the war movies I really like are during.\n\nMy all time favorite movie is Inglorious bastards.. Recently watched Triple Six Eight, loved it.. I like 300 better than Gladiator\n\nI'm looking for some recommendations :).Thanks",
            "subreddit": "MovieSuggestions",
            "author": "91apples",
            "score": 23,
            "date": "2024-12-26 03:58:59"
        },
        {
            "title": "Good movies with tough guys fighting injustice, for freedom or honor?",
            "body": "I'm looking for movies like Gladiator, 300, private justice, Braveheart, the Dark Knight...?\nOr even 8 mile.\n\nEdit: Thinking about it I enjoy how they follow their own morale compass which drive their \"rebellion\". \n\nWhich is taboo in some places so we don't get many movies like these anymore.",
            "subreddit": "MovieSuggestions",
            "author": "ImaginationAnnual549",
            "score": 7,
            "date": "2024-12-19 22:56:39"
        },
        {
            "title": "Looking for movie suggestions for my adult family to watch during the holidays",
            "body": "My husband and I are visiting my family for 4 days. The movies don’t have to be kid-friendly since there won’t be any kids present. I don’t need christmas movie suggestions, we have that covered 🙂. We’re open to most genres, with the following exceptions. My sisters don’t care for Marvel. Horror is a definite no-go for my mom and she doesn’t care for anything too vulgar. \n\nHere are some of the movies we’ve all enjoyed:\n* A Beautiful Mind\n* Lion\n* Slumdog Millionaire\n* Knives Out\n* Barbie\n* A Beautiful Day in the Neighborhood\n* Julie &amp; Julia\n* We Bought a Zoo\n* Chef\n* Knocked Up\n* Bridesmaids\n* Mean Girls\n* Ferris Bueller’s Day Off\n* 10 Things I Hate About You\n* Good Will Hunting\n* Father of the Bride\n* My Big Fat Greek Wedding\n* Moonstruck\n* The Help\n* Hidden Figures\n* The Dark Knight\n* Interstellar\n* 1917\n* Catch Me If You Can\n* No Country for Old Men\n* Inglorious Bastards\n* Once Upon a Time in Hollywood\n* Gladiator\n* The Departed\n* The Town\n \nThank you in advance!\n",
            "subreddit": "MovieSuggestions",
            "author": "givemeabookandgarden",
            "score": 2,
            "date": "2024-12-19 17:09:46"
        },
        {
            "title": "I'm looking for some great historical movie recommendations! ",
            "body": "Especially focusing on the Roman Empire. I've seen classics like Gladiator, Troy and to explore more films that capture this fascinating era. I know Ben Hur is a great one but I cannot watch really old movies. \n\nFeel free to suggest any historical movies outside of the Roman theme as well! They don’t need to be 100% accurate—just something engaging and entertaining. Thanks in advance for your suggestions!\n",
            "subreddit": "MovieSuggestions",
            "author": "winterresetmylife",
            "score": 3,
            "date": "2024-12-16 12:52:32"
        },
        {
            "title": "A movie that is period piece but a character based story",
            "body": "Apologies if I didn’t ask correctly. I’m looking for something like the promised land (2023 with Mads Mikkselson) or gladiator (original). An historical movie but more centred around the characters than the epic CGI etc. \nthanks :)",
            "subreddit": "MovieSuggestions",
            "author": "Indienerd89076",
            "score": 2,
            "date": "2024-12-14 17:56:05"
        },
        {
            "title": "Husband and wife movie night suggestions ",
            "body": "My husband and I want to start having a movie night once a week. We just have trouble finding movies that we think we will both like. He loves history and I’m more of a rom-com or drama fan. I do enjoy movies with action or suspense as well. \n\nI’d appreciate any suggestions! We’re open to classics but we also want to try out some new movies. \n\nHere’s some that we’ve both enjoyed: \n- The Departed\n- Uncut Gems \n- Gladiator \n- Dune (part 1 and 2, new versions)\n- Parasite \n- Lion \n- 1917\n- A Beautiful Mind \n- The Dark Knight \n- Inglorious Bastards \n- Meet the Parents \n- Wedding Crashers\n- Knocked Up\n\nThere’s definitely more but this is all I can think of on the spot. TIA!",
            "subreddit": "MovieSuggestions",
            "author": "givemeabookandgarden",
            "score": 2,
            "date": "2024-12-13 21:33:30"
        },
        {
            "title": "I need your suggestions for good sword-and-sandal films",
            "body": "I really enjoyed “Cleopatra” and “Ben-Hur”. Which other sword-and-sandal movies would you recommend? I’m interested in watching both classic peplum movies as well as more recent neo-peplum movies like “Gladiator. ",
            "subreddit": "MovieSuggestions",
            "author": "Tm-534",
            "score": 3,
            "date": "2024-12-13 09:08:36"
        },
        {
            "title": "History Through Film Class- Suggestions ",
            "body": "Hey! Just like the title says I have a History Through Films class I teach. It will be my 5th time teaching it next year, and I personally am starting to get bored with what I show. I generally get through 12-15 movies a trimester, depending on how the class is.\n\nSo, I am looking for suggestions on films I can show. The beauty of this class is that it is for High Schoolers, and they have to sign waivers that they may watch r-rated or more \"serious\" movies.\n\nBelow is a list of movies I generally use right now. Really, any suggestions need to be historical/war based, and no longer than 3 hours, but inaccurate yet fun movies are welcome. The second beauty of the class is that we often discuss the inaccuracy of films and if films are a healthy medium for learning history.\n\nLastly, please no Holocaust suggestions. A fellow teacher actually teaches a holocaust class, and I have much more freedom in what I show so I don't like to encroach on what they have available \n\nI appreciate any help in advance \n\nLast years movies:\n\nGladiator\n\nBraveheart\n\nCrucible\n\nThe Patriot\n\nAmistad\n\nGlory\n\nDances with wolves\n\n8 men out\n\nGallipoli\n\nThe Untouchables\n\nDunkirk\n\nAmerican Graffiti \n\n13 Days\n\n",
            "subreddit": "MovieSuggestions",
            "author": "kumquat_killer",
            "score": 4,
            "date": "2024-12-09 16:50:02"
        },
        {
            "title": "Massive Screen Must Watches (Read what we already watched first)",
            "body": "I've been working a temporary job the past 11 months where we get access to a huge projector screen. Me and some coworkers have been using it to watch tons of amazing movies, and as the job is ending in a few weeks, we wanted to know what else Reddit would consider \"must watch\" on the big screen.\n\nSo far we have watched: Interstellar, Inceptipn, 2001 A Space Odyssey, Dune (Villenueve) part 1 and 2, Muholland Drive, Lost Highway, The Revenant, Ran, Lawrence of Arabia, Jaws, Hero, Apocalypse Now, Taxi Driver, all 3 LotR movies (extended), both Blade Runner movies, Come and See, Sicario, Harakiri, Ghost in the Shell, Akira, Gladiator, Gravity, Avatar Way of Water, Top Gun Maverick, EEAAO, Midnight Cowboy, The Northman, Terminator 1 &amp; 2, The Godfather 1 &amp; 2, Mad Max Fury Road, Grand Budapest Hotel, Seven Samurai, Dunkirk, Roma, Pan's Labyrinth, The Dark Knight, Children of Men, 1917, Spiderverse 1 &amp; 2, Suspiria (Argento), Birdman, Pulp Fiction, Arrival, TGTBTU, Kill Bill, Reservoir Dogs, Django, Inglorious Basterds (Tarantino), Hateful Eight, the Shining, and Jurassic Park.\n\nIt feels like we have exhausted pretty much 99.99% of our friends' and online suggestions for watching on a big screen, so we wanted to see if we can squeeze a few more out from Reddit as we are pretty much done with our work and just get to chill most of the time and have time to watch a bunch of movies.",
            "subreddit": "MovieSuggestions",
            "author": "w-wg1",
            "score": 2,
            "date": "2024-12-04 07:29:03"
        },
        {
            "title": "Movies from past decade involving a sandy climate like gladiator 2 or dune",
            "body": "Movies from past decade involving a sandy climate like gladiator 2 or dune\n\nSomething about these movies in a desert is appealing to me.  Gladiator 2 and dune 1/2 are examples of what I'm looking for.  Can be any type.  I mean westerns are fine too.  Dune is kind of a scifi western if you think about it.  I also enjoyed the book of boba fett but thats a tv series.  I feel a lot of movies have bad ratings so it's hard to find something actually decent.  I also liked mad max and furiousa.",
            "subreddit": "MovieSuggestions",
            "author": "legomaniasquish",
            "score": 2,
            "date": "2024-12-02 17:12:51"
        },
        {
            "title": "Violent Middle Age Movies",
            "body": "I’m looking for movies along the lines of Braveheart, The Outlaw King, Gladiator Ironclad, Immortals, Troy etc. I really enjoy movies about conflicts in the Middle East and the gorier the suggestions the better. It can be Anglo-Scottish, Medieval England, Rome etc. I’m just struggling to find more movies like the ones I mentioned that pair a good story with brutal battles so any help would be appreciated!\n\nEDIT: Just wanted to say thank you to everyone who replied here, my watch list has definitely grown after reading all the replies and I appreciate all the suggestions, so again thank you all!",
            "subreddit": "MovieSuggestions",
            "author": "xXKing-NuggetXx",
            "score": 10,
            "date": "2024-12-02 11:37:41"
        },
        {
            "title": "Movies with scenes like Gladiator where he reveals himself",
            "body": "I am looking for movies that have scenes similar to Gladiator where after the battle, he revealed himself to Joaquin Phoenix as Maximus. That's where everyone found out who he truly was and that he wasn't an average person but someone lot bigger",
            "subreddit": "MovieSuggestions",
            "author": "Aggravating-Bike-397",
            "score": 2,
            "date": "2024-12-01 21:51:57"
        },
        {
            "title": "Movies similar to gladiator and/or Kaos the tv show?",
            "body": "Trying to find good mythology/historical adaptations either modernized or historically based. Obviously there's a ton, and I've seen *gladiator*, *pompeii*, *troy,* *troy fall of a city*, the updated *percy jackson* show, *kaos*, *barbarians*, and a little bit of *American gods*. The thing I've been struggling with is finding ones that didn't age horribly. Could not get through *300* it was so so painful and offensive to watch personally, so anything that's more modern like *kaos* or at least vaguely historically/myth based like *troy fall of a city* that would be amazing. Tons and tons of bonus points for if it passes the bechdel test or has at least 1 interesting female character, but idk how reasonable that is in this genre. I'm desperate for suggestions! Thanks!",
            "subreddit": "MovieSuggestions",
            "author": "Ok_Force3490",
            "score": 2,
            "date": "2024-12-01 10:00:47"
        },
        {
            "title": "spartacus or gladiator 1",
            "body": "i need help choosing what movie to watch. quickly please… i wanna watch gladiator 1 so i can watch gladiator 2, but spartacus seems like a good gladiator movie too.",
            "subreddit": "MovieSuggestions",
            "author": "brolando-",
            "score": 2,
            "date": "2024-11-30 03:16:59"
        },
        {
            "title": "Looking for political/legal dramas",
            "body": "So my bf recently came to the discovery that he really likes political dramas. He enjoys the type of movie where people are able to kind of verbally spar, where dialogue has a lot of narrative weight and can shift the course of the story. His favorites of this genre are A Few Good Men, The Social Network, Challengers, and Gladiator. They can have other elements (action, mystery, etc.), but I’m looking for things like this bc we’ve been watching a lot of movies that I like but he’s not enjoying as much, and this type scratches a very specific itch for him. Thank you!",
            "subreddit": "MovieSuggestions",
            "author": "Alert-Lavishness6570",
            "score": 2,
            "date": "2024-11-28 22:45:35"
        },
        {
            "title": "Movie/Series based on mediaeval times",
            "body": "I love series or movie based on mediaeval or even ancient time period. Have watched GOT, Vikings, The Last Kingdom, Vinland saga, Berserk,LOTR, gladiator, the duel, Troy,wrath of titans etc. Currently watching Vikings Valhalla. I need more of those! ",
            "subreddit": "MovieSuggestions",
            "author": "Far_Science_4382",
            "score": 3,
            "date": "2024-11-28 15:37:24"
        }
    ]
}